PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/include/cy_autanalog_sar.h
/***************************************************************************//**
* \file cy_autanalog_sar.h
* \version 2.0
*
* Provides an API declaration of the SAR ADC subsystem of the Autonomous Analog.
*
********************************************************************************
* \copyright
* Copyright 2022-2025 Cypress Semiconductor Corporation
* SPDX-License-Identifier: Apache-2.0
*
* Licensed under the Apache License, Version 2.0 (the "License");
* you may not use this file except in compliance with the License.
* You may obtain a copy of the License at
*
*     http://www.apache.org/licenses/LICENSE-2.0
*
* Unless required by applicable law or agreed to in writing, software
* distributed under the License is distributed on an "AS IS" BASIS,
* WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
* See the License for the specific language governing permissions and
* limitations under the License.
*******************************************************************************/

/**
* \addtogroup group_autanalog_sar
* \{
* This driver provides the API functions to configure the successive approximation register analog-to-digital converter
* (SAR ADC) subsystem of the Autonomous Analog.
*
* The versatile SAR ADC is an analog-to-digital converter with a dual-core 12-bit successive approximation register.
* The SAR ADC (hereafter ADC) contains a High Speed (HS) Core that can operate in Active mode with the SRSS clock up to 80 MHz
* and a Low Power (LP) Core based on the 4.096 MHz LPOSC from the Autonomous Analog.
* The HS Core is not available in DeepSleep while the LP Core is available in all power modes.
* \note Only one core can be active at a time.
*
* For more information on the ADC,
* refer to the device Architecture Technical Reference Manual (TRM).\n
* For the exact location of the pins, see the device datasheet.
*
* The key components of the ADC are:
* - The inputs selector for routing signals from external pins (GPIO) or analog-capable internal IOs (MUX);
* - A pair of Hi-Z buffers, which are in the MUX path only and can be bypassed;
* - The sampler with sample and hold circuits (S/H) for simultaneous sampling from multiple sources:
*    - 8 single-ended S/H circuits directly connected to the GPIO and available in Active mode only;
*    - 2 single-ended S/H circuits connected to the MUX IOs and available in Active mode only;
*    - 1 fully differential sampler for all sources, available in Active and Deep Sleep modes;
* - The source of reference voltages for HS/LP ADC Cores;
* - Post-processing of the ADC output;
*
* \section group_autanalog_sar_ch Channel Configuration
*
* The signal path to the ADC input is controlled by the logical channel (a high-level abstraction).
* The configuration of the ADC logical channel includes the following settings (common for HS//LP modes):
*    - assign the source for the ADC input
*      (refer to \ref cy_en_autanalog_sar_pin_hs_t for GPIO sources and
*      \ref cy_en_autanalog_sar_pin_mux_t for MUX sources accordingly);
*    - configuration of the allowable range for the ADC
*      (refer to \ref cy_en_autanalog_sar_limit_t);
*    - signed/unsigned the format for the ADC output data
*      (refer to \ref group_autanalog_sar_sign chapter);
*    - enable the averaging of the conversion result in HW;
*    - store the conversion result in the FIFO
*      (refer to \ref cy_en_autanalog_fifo_sel_t)
*    - correct the linearity of the channel - channel gain and offset
*      (refer to \ref cy_en_autanalog_sar_ch_coeff_t and \ref Cy_AutAnalog_SAR_LoadOffsetGainCorr)
*
* Also:
*    - enable the pseudo differential sampling for the single-ended ADC in HS mode
*      (refer to cy_stc_autanalog_sar_hs_chan_t::hsDiffEn and cy_stc_autanalog_sar_seq_tab_hs_t::muxMode);
*      \note Negative input correction coefficient is applicable only for
*      the second channel in Pseudo Differential sampling mode
*    - support Single-ended mode for ADC in LP mode of operation
*      (refer to cy_stc_autanalog_sar_sta_lp_t::lpDiffEn);
*    - bypass the Hi-Z buffers for MUX channels
*      (refer to cy_stc_autanalog_sar_mux_chan_t::buffBypass)
*
* 8 individually-configurable logical channels are available to the ADC in HS mode and
* 16 logical channels are available to the ADC in LP mode.
*
* The logical channels configuration is a part of the ADC \ref group_autanalog_sar_static
* (refer to cy_stc_autanalog_sar_sta_hs_t::hsGpioChan for GPIO inputs and
* \ref cy_stc_autanalog_sar_sta_t::intMuxChan for MUX inputs accordingly).
*
* \section group_autanalog_sar_static Static Configuration
*
* The static configuration contains application-specific settings
* intended to remain static for any ADC application.
* The Autonomous Controller (AC) will NOT change the static configuration during operation.
*
* The diagram below shows the static configuration for ADC in HS mode.
*
* \image html LPPASS_ADC_HS_Static.png
*
* The diagram below shows the static configuration for ADC in LP mode.
*
* \image html LPPASS_ADC_LP_Static.png
*
* The diagram below shows the static configuration for LP ADC in Single Ended mode.
*
* \image html LPPASS_ADC_LP_Static_SE.png
*
* The static configuration for the whole ADC consists of static configurations for the HS and LP parts
* (refer to \ref cy_stc_autanalog_sar_sta_hs_t, \ref cy_stc_autanalog_sar_sta_lp_t)
* and includes the following settings in total (refer to \ref cy_stc_autanalog_sar_sta_t):
*    - the reference voltage source for the HS and LP Cores of the ADC
*      (refer to cy_stc_autanalog_sar_sta_hs_t::hsVref and cy_stc_autanalog_sar_sta_lp_t::lpVref);
*    - a set of sample times for the ADC input
*      (refer to cy_stc_autanalog_sar_sta_hs_t::hsSampleTime and cy_stc_autanalog_sar_sta_lp_t::lpSampleTime);
*    - average mode settings
*      (refer to cy_stc_autanalog_sar_sta_t::accMode and cy_stc_autanalog_sar_sta_t::shiftMode);
*    - the notification of the conversion result for the selected input of the ADC or the output of the FIR filter
*      (refer to cy_stc_autanalog_sar_sta_hs_t::hsGpioResultMask and cy_stc_autanalog_sar_sta_t::muxResultMask
*      for the GPIO inputs and MUX inputs accordingly or cy_stc_autanalog_sar_sta_t::firResultMask for the FIR filter output);
*    - a set of conditions for the allowable range of the ADC
*      (refer to cy_stc_autanalog_sar_sta_t::limitCond);
*    - the presence of the logical channel ID in FIFO data (refer to cy_stc_autanalog_sar_sta_t::chanID);
*    - the ADC calibration during start-up (refer to cy_stc_autanalog_sar_sta_t::startupCal);
*
* Also:
*    - Power mode for the Hi-Z buffers
*      (refer to cy_stc_autanalog_sar_sta_t::posBufPwr and cy_stc_autanalog_sar_sta_t::negBufPwr);
*
* \section group_autanalog_sar_sequencer Sequencer and State Transition Table
*
* The sequencer is used to control the ADC to perform an automatic scan on all enabled logical channels without MCU intervention.
* Each ADC Core has its own sequencer, refer to \ref cy_stc_autanalog_sar_seq_tab_hs_t for HS mode and
* refer to \ref cy_stc_autanalog_sar_seq_tab_lp_t for LP mode. Both sequencers contain up to 32 states.
* Each state of the sequencer defines a single step in the ADC scan.

* The Autonomous Controller is able to trigger the ADC. It points to a particular step (Entry State) of the sequencer in runtime
* using the State Transition Table, refer to \ref cy_stc_autanalog_stt_sar_t.
* The next step of the sequencer is defined in the nextAction field of the sequencer configuration structure
* (refer to e.g. cy_stc_autanalog_sar_seq_tab_hs_t::nextAction):
*    - NEXT - Go to the next sequencer state to proceed to the next step in a given ADC scan;
*    - ENTRY_ADDR - Assert the SAR_EOS condition and jump to Entry State for continuous ADC scanning;
*    - STOP - Assert the SAR_DONE and SAR_EOS conditions and go to Idle to indicate the end of a scan;
*
* The remaining fields of the sequencer are (common for HS//LP modes):
*    - enable and select the appropriate sample time configuration for a particular logical channel
*      (refer to e.g. cy_stc_autanalog_sar_seq_tab_hs_t::sampleTimeEn and cy_stc_autanalog_sar_seq_tab_hs_t::sampleTime);
*    - enable the averaging for the ADC conversion result and define the average count
*      (refer to e.g. cy_stc_autanalog_sar_seq_tab_hs_t::accEn and cy_stc_autanalog_sar_seq_tab_hs_t::accCount);
*
* Also, the HS sequencer allows you to configure the following:
* - enable and select specific GPIO channels, refer to cy_stc_autanalog_sar_seq_tab_hs_t::chanEn
*   with their configurations provided in the cy_stc_autanalog_sar_sta_hs_t::hsGpioChan;
* - enable and select the operation mode for specific MUX channels, refer to cy_stc_autanalog_sar_seq_tab_hs_t::muxMode.
*   Select the configurations for the enabled MUX channels
*   cy_stc_autanalog_sar_seq_tab_hs_t::mux0Sel, cy_stc_autanalog_sar_seq_tab_hs_t::mux1Sel
*   provided in the cy_stc_autanalog_sar_sta_t::intMuxChan;
*
* Also, the LP sequencer allows you to configure the following:
* - enable the operation for the LP sampler cy_stc_autanalog_sar_seq_tab_lp_t::chanEn and
*   select the configuration for the MUX channel cy_stc_autanalog_sar_seq_tab_lp_t::mux0Sel
*   provided in the cy_stc_autanalog_sar_sta_t::intMuxChan;
*
* The ADC scan can be started by the Autonomous Controller (AC) in runtime
* per settings provided in the sequencer (refer to cy_stc_autanalog_sar_seq_tab_hs_t, \ref cy_stc_autanalog_sar_seq_tab_lp_t)
* and State Transition Table (refer to \ref cy_stc_autanalog_stt_sar_t structure).
*
* \note When ADC is powered down, the ADC logic and FIRs are reset, ADC/FIR clocks are gated, and all ADC AC conditions
*       are cleared. The ADC configuration and sequencer tables are retained. The FIFO status and content are not cleared,
*       i.e. the FIFO contents can still be read if the ADC is disabled.
*
* \section group_autanalog_sar_clk Clock and Throughput
*
* The ADC in HS mode is clocked from the SRSS peripheral clock
* (Clk_HF9, up to 80MHz, refer to \ref group_autanalog_section_configuration) in chip Active mode
* using Peri 0 Clock Group 2 8-bit divider in the clock chain.\n
* The ADC in LP mode is clocked from the local Low Power Oscillator
* (LPOSC, 4096kHz, refer to \ref cy_en_autanalog_timer_clk_src_t) in chip Deep Sleep mode.\n
*
* <table class="doxtable">
*    <tr>
*       <th>ADC mode</th>
*       <th>Clock source</th>
*       <th>Clock frequency, MHz</th>
*       <th>Throughput, samples/s</th>
*    </tr>
*    <tr>
*       <td>High Speed</td>
*       <td>Clk_HF9</td>
*       <td>80</td>
*       <td>5Msps</td>
*    </tr>
*    <tr>
*       <td>Low Power</td>
*       <td>LPOSC</td>
*       <td>4.096</td>
*       <td>200ksps</td>
*    </tr>
* </table>
*
* \section group_autanalog_sar_sampling Sample Time
*
* The sample time can be set separately for each HS\\LP ADC Cores.
*
* For HS mode, enable this option in the corresponding ADC sequencer,
* refer to cy_stc_autanalog_sar_seq_tab_hs_t::sampleTimeEn, cy_stc_autanalog_sar_seq_tab_hs_t::sampleTime.
* And the selection of a particular value of the acquisition time is defined in the corresponding Static configuration,
* refer to cy_stc_autanalog_sar_sta_hs_t::hsSampleTime.
*
* For LP mode, enable this option in the corresponding ADC sequencer,
* refer to cy_stc_autanalog_sar_seq_tab_lp_t::sampleTimeEn, cy_stc_autanalog_sar_seq_tab_lp_t::sampleTime.
* The selection of a particular value of the acquisition time is defined in the corresponding Static configuration,
* refer to cy_stc_autanalog_sar_sta_lp_t::lpSampleTime.
*
* \note 5us is the recommended sampling time for Die temperature measurement.
*
*   \section group_autanalog_sar_vref Reference Voltage
*
* The level of the reference voltage can be defined separately for each HS\\LP ADC Cores
* in the corresponding parts of the Static configuration,
* refer to cy_stc_autanalog_sar_sta_hs_t::hsVref and cy_stc_autanalog_sar_sta_lp_t::lpVref.
*
* For the PRB configuration settings, refer to \ref cy_stc_autanalog_prb_t structure.
*
* \note Vdda is 1.8V and Vbgr is 0.9V
*
* \section group_autanalog_sar_pump Buffer Input and Output Ranges
*
* The input range of the buffer can be rail-to-rail if the charge pump is enabled.
* Without the charge pump, the input range is 0 V to VDDA - 1.5 V. The output range
* of the buffer is typically 0.2 V to VDDA - 1.0 V.
* See the device datasheet for more details.
*
* <table class="doxtable">
*    <tr>
*       <th>Charge Pump</th>
*       <th>Input Range</th>
*       <th>Output Range</th>
*    </tr>
*    <tr>
*       <td>Enabled</td>
*       <td>0 V to VDDA</td>
*       <td>0.2 V to VDDA - 0.2 V</td>
*    </tr>
*    <tr>
*       <td>Disabled</td>
*       <td>0 V to VDDA - 1.5 V</td>
*       <td>0.2 V to VDDA - 1.0 V</td>
*    </tr>
* </table>
*
* \note The charge pump nominal clock is 4MHz
*
* For the configuration settings, see \ref cy_en_autanalog_sar_buf_pwr_t.
*
* \section group_autanalog_sar_sign Signed/Unsigned Output
*
* The ADC conversion result and the FIR//FIFO output are represented as 32-bit width integer,
* (zero or sign extended) regardless of the actual resolution of the ADC.
*
* For the configuration settings,
* refer to cy_stc_autanalog_sar_hs_chan_t::sign and cy_stc_autanalog_sar_mux_chan_t::sign.
*
* \section group_autanalog_sar_result Handling of the Result
*
* The results of the ADC conversion or FIR filtering can be stored with further notification about update,
* or sent directly to the FIFO buffer.
* To save the result for a specific logical channel or FIR filter,
* use the following settings in the Static configuration:
* - GPIO channels result mask, refer to cy_stc_autanalog_sar_sta_hs_t::hsGpioResultMask;
* - MUX channels result mask, refer to cy_stc_autanalog_sar_sta_t::muxResultMask;
* - FIR filters result mask, refer to cy_stc_autanalog_sar_sta_t::firResultMask;
*
* \section group_autanalog_sar_avg Averaging
*
* The ADC subsystem includes an accumulator and shift registers to support the averaging at the hardware level.
*
* To configure the averaging for the ADC conversion result, use:
* - enable the averaging (applies to all channels enabled in the sequencer) in the sequencer configuration
*   (refer e.g. to cy_stc_autanalog_sar_seq_tab_hs_t::accEn);
*
* - enable and select Averaging mode in the Static configuration (refer to cy_stc_autanalog_sar_sta_t::accMode)
*    - ACCUNDUMP - the enabled channels will be sampled, converted, and accumulated back to back.
*      After e.g. cy_stc_autanalog_sar_seq_tab_hs_t::accCount times, the accumulated results for each enabled channels are
*      optionally shifted (refer to e.g. cy_stc_autanalog_sar_hs_chan_t::accShift);
*
* - define the average count in the sequencer configuration (refer to e.g. cy_stc_autanalog_sar_seq_tab_hs_t::accCount);
* - enable the averaging execution in HW (refer to e.g. cy_stc_autanalog_sar_hs_chan_t::accShift);
* - define the mode of the average shift (result resolution) if the averaging is carried out by the HW
*   (refer to cy_stc_autanalog_sar_sta_t::shiftMode):
*   - TWELVE - after the last accumulation, the result is shifted back to 12 bits;
*   - SIXTEEN - after the last accumulation, if the average count >= 32, the result will be shifted back to 16-bits,
*               if the average count < 32, no shift will be done as the result is already guaranteed to fit in 16 bits.
*
* \section group_autanalog_sar_fir FIR Filter
*
* Two instances of the 64-tap FIR filters are available for the ADC post-processing.
*
* The FIR filter configuration (refer to \ref cy_stc_autanalog_sar_fir_cfg_t) includes:
* - the source for the FIR filter input defined in \ref cy_en_autanalog_sar_fir_channel_t;
* - the FIR filter order, refer to cy_stc_autanalog_sar_fir_cfg_t::tapSel;
* - the array of FIR filter coefficients, refer to cy_stc_autanalog_sar_fir_cfg_t::coeff.\n
*   The coefficient values may range from -1 + 1/2^15 to 1 - 1/2^15, with a resolution of 1/2^15.\n
*   The coefficient uses the two-complement notation and the decimal point is fixed to the right of the most significant bit.\n
*   Example: -0.25 = 0xE000 and 0.25 = 0x2000
* - the FIR filter output scaling, refer to cy_stc_autanalog_sar_fir_cfg_t::shiftSel;
* - the FIR filter output init delay, refer to cy_stc_autanalog_sar_fir_cfg_t::waitTapInit;
* - routing the FIR filter output to the FIFO, refer to cy_stc_autanalog_sar_fir_cfg_t::fifoSel;
* - range detection, refer to refer to cy_stc_autanalog_sar_fir_cfg_t::firLimit;
*
* \section group_autanalog_sar_int Interrupts, Triggers and STT Events
*
* The following internal events of the ADC can be configured to generate an interrupt or trigger
* or used as the STT event in the Autonomous Analog
* (refer to \ref cy_en_autanalog_ac_out_trigger_mask_t and \ref cy_en_autanalog_stt_ac_condition_t):
* - SAR_EOS - Indicates the end of the scanning of the logical ADC channels by the sequencer;
* - SAR_RESULT (interrupt only) - Indicates an updated ADC conversion result;
* - SAR_DONE - Indicates that the sequencer stopped scanning the ADC;
* - SAR_RANGE - Indicates range detection conditions;
* - SAR_FIR_RESULT (interrupt only) - Indicates an updated FIR filter calculation result;
* - SAR_BUSY (STT event only) - Indicates that the ADC is in conversion;
* - SAR_FIR_DONE (STT event only) - Indicates an updated FIR filter result;
* - SAR_FIFO_DONE (STT event only) - Indicates SAR_DONE ANDED with FIFO writing complete;
* - SAR_FIR_FIFO_DONE (STT event only) - Indicates that the FIR filter result is sent to the FIFO;
*
* Refer to \ref group_autanalog_fifo_int chapter for the FIFO events.
*
* \section group_autanalog_sar_sample1 Sample use case: Die Temperature
*
* \snippet autanalog_sar1/autanalog_sar.c SNIPPET_ADC_SCENARIO1
*
* \snippet autanalog_sar1/autanalog_sar.c SNIPPET_ADC_INCLUDES1
*
* \snippet autanalog/snippet/autanalog_sar.c SNIPPET_ADC_DEFINES1
*
* \snippet autanalog_sar1/autanalog_sar.c SNIPPET_ADC_CH_GPIO
*
* \snippet autanalog_sar1/autanalog_sar.c SNIPPET_ADC_CH_MUX
*
* \snippet autanalog_sar1/autanalog_sar.c SNIPPET_ADC_STATIC_HS
*
* \snippet autanalog_sar1/autanalog_sar.c SNIPPET_ADC_STATIC_LP
*
* \snippet autanalog_sar1/autanalog_sar.c SNIPPET_ADC_STATIC
*
* \snippet autanalog_sar1/autanalog_sar.c SNIPPET_ADC_SEQUENCER_HS
*
* \snippet autanalog_sar1/autanalog_sar.c SNIPPET_ADC_SEQUENCER_LP
*
* \snippet autanalog_sar1/autanalog_sar.c SNIPPET_ADC_CONFIG
*
* \snippet autanalog_sar1/autanalog_sar.c SNIPPET_ADC_STT
*
* \snippet autanalog/snippet/autanalog_sar.c SNIPPET_ADC_INIT_COMMON
*
* \snippet autanalog/snippet/autanalog_sar.c SNIPPET_ADC_LOLAD_CFG
*
*   \defgroup group_autanalog_sar_macros Macros
*   \{
*     \defgroup group_autanalog_sar_hs_chan_macros High Speed Channels and Masks
*     \defgroup group_autanalog_sar_lp_chan_macros Low Power Channels and Masks
*     \defgroup group_autanalog_fir_macros         FIR filter Channels and Masks
*   \}
*   \defgroup group_autanalog_sar_functions Functions
*   \{
*       \defgroup group_autanalog_sar_functions_init   Initialization Functions
*       \defgroup group_autanalog_sar_functions_status Status Functions
*       \defgroup group_autanalog_sar_functions_conv   Conversion Functions
*       \defgroup group_autanalog_sar_functions_fir    FIR Filter Functions
*   \}
*   \defgroup group_autanalog_sar_data_structures Data Structures
*   \defgroup group_autanalog_sar_enums Enumerated Types
*
* \}
*
* \addtogroup group_autanalog_fifo
* \{
*   The FIFO subsystem is used to store the ADC data or the FIR filter results.
*   The FIFO buffer consists of 512 32-bit words and FIFO fullness can be signaled by means of an interrupt.
*   The ADC measurements stored in the FIFO can be supplemented with the channel IDs.
*
*   \section group_autanalog_fifo_static Static Configuration
*
*   The static configuration contains application-specific settings
*   intended to remain static for any FIFO application.
*   The Autonomous Controller (AC) will NOT change the static configuration during operation.
*
*   The FIFO buffer can be divided into several (maximum 8) sub-FIFOs
*   each with independent read/write/status functionality.
*   For configuration settings, see \ref cy_stc_autanalog_fifo_cfg_t structure.
*
* \section group_autanalog_fifo_dynamic Dynamic Configuration
*
* The Dynamic Configuration is not available for the FIFO subsystem.
*
*  \section group_autanalog_fifo_int Interrupts, Triggers and STT Events
*
*  A FIFO level status can be configured as an output trigger and/or as an interrupt to wake up the CPU:
*  - FIFO_UNDERFLOW (interrupt only) - Indicates empty conditions for the FIFO, read value ni this case is undefined;
*  - FIFO_OVERFLOW (interrupt only) - Indicates overflow conditions for the FIFO, hardware will not over-write the FIFO;
*  - FIFO_LEVEL - Indicates FIFO level event, see \ref cy_stc_autanalog_fifo_cfg_t::level setting;
*
*   \defgroup group_autanalog_fifo_macros Macros
*   \defgroup group_autanalog_fifo_functions Functions
*   \{
*       \defgroup group_autanalog_fifo_functions_init Initialization Functions
*       \defgroup group_autanalog_fifo_functions_int Interrupt Functions
*   \}
*   \defgroup group_autanalog_fifo_data_structures Data Structures
*   \defgroup group_autanalog_fifo_enums Enumerated Types
* \}
*/

#if !defined(CY_AUTANALOG_SAR_H)
#define CY_AUTANALOG_SAR_H

