PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/include/cy_autanalog_sar.h
#include "cy_device.h"

#ifdef CY_IP_MXS22LPPASS_SAR

#include "cy_autanalog_common.h"

#if defined(__cplusplus)
extern "C" {
#endif

/** \addtogroup group_autanalog_sar_macros
* \{
*/

/** The number of High Speed and Low Power ADC sequencers.
 * For more details, refer to the device Architecture Technical Reference Manual.
 */
#define CY_AUTANALOG_SAR_SEQUENCER_NUM                     (32UL)

/** Number of ADC input sampling timers.
 * For more details, refer to the device Architecture Technical Reference Manual.
 */
#define CY_AUTANALOG_SAR_SAMPLE_TIME_NUM                   (4UL)

/** The number of structures for configuring the limits of the ADC result.
 * For more details, refer to the device Architecture Technical Reference Manual.
 */
#define CY_AUTANALOG_SAR_LIMIT_CFG_NUM                     (4UL)

/** The number of ADC channel correction coefficients.
 * For more details, refer to the device Architecture Technical Reference Manual.
 */
#define CY_AUTANALOG_SAR_CH_CORR_COEFF_NUM                 (8UL)

/** The number of FIR filters.
 * For more details, refer to the device Architecture Technical Reference Manual.
 */
#define CY_AUTANALOG_SAR_FIR_NUM                           (2UL)

/** The maximum number of taps in FIR filter configuration.
 * For more details, refer to the device Architecture Technical Reference Manual.
 */
#define CY_AUTANALOG_SAR_FIR_TAP_NUM                       (64UL)


/** \addtogroup group_autanalog_sar_hs_chan_macros
* The ADC HS mode: can be ORed together and applied to the cy_stc_autanalog_sar_seq_tab_hs_t::chanEn
* \{
*/

/** The GPIO channels masks */
#define CY_AUTANALOG_SAR_CHAN_MASK_GPIO_DISABLED           (0x00000000UL) /**< The GPIO channels disabled */
#define CY_AUTANALOG_SAR_CHAN_MASK_GPIO0                   (0x00000001UL) /**< The GPIO channel 0 */
#define CY_AUTANALOG_SAR_CHAN_MASK_GPIO1                   (0x00000002UL) /**< The GPIO channel 1 */
#define CY_AUTANALOG_SAR_CHAN_MASK_GPIO2                   (0x00000004UL) /**< The GPIO channel 2 */
#define CY_AUTANALOG_SAR_CHAN_MASK_GPIO3                   (0x00000008UL) /**< The GPIO channel 3 */
#define CY_AUTANALOG_SAR_CHAN_MASK_GPIO4                   (0x00000010UL) /**< The GPIO channel 4 */
#define CY_AUTANALOG_SAR_CHAN_MASK_GPIO5                   (0x00000020UL) /**< The GPIO channel 5 */
#define CY_AUTANALOG_SAR_CHAN_MASK_GPIO6                   (0x00000040UL) /**< The GPIO channel 6 */
#define CY_AUTANALOG_SAR_CHAN_MASK_GPIO7                   (0x00000080UL) /**< The GPIO channel 7 */

/** The MUX channels configurations */
#define CY_AUTANALOG_SAR_CHAN_CFG_MUX_DISABLED             (0x00000000UL) /**< The MUX channels disabled */
#define CY_AUTANALOG_SAR_CHAN_CFG_MUX0_SINGLE_ENDED        (0x00000001UL) /**< The MUX channel 0 single ended */
#define CY_AUTANALOG_SAR_CHAN_CFG_MUX1_SINGLE_ENDED        (0x00000002UL) /**< The MUX channel 1 single ended */
#define CY_AUTANALOG_SAR_CHAN_CFG_MUX0_MUX1_SINGLE_ENDED   (0x00000003UL) /**< The MUX channel 0, 1 single ended */
#define CY_AUTANALOG_SAR_CHAN_CFG_MUX0_PSEUDO_DIFF         (0x00000004UL) /**< The MUX channel pseudo differential */

/** \} group_autanalog_sar_hs_chan_macros */


/** \addtogroup group_autanalog_sar_lp_chan_macros
* The ADC LP mode.
* \{
*/
/** The MUX channels configurations */
#define CY_AUTANALOG_SAR_CHAN_CFG_MUX0                     (0x00000000UL) /**< The MUX channel 0 */
#define CY_AUTANALOG_SAR_CHAN_CFG_MUX1                     (0x00000001UL) /**< The MUX channel 1 */
#define CY_AUTANALOG_SAR_CHAN_CFG_MUX2                     (0x00000002UL) /**< The MUX channel 2 */
#define CY_AUTANALOG_SAR_CHAN_CFG_MUX3                     (0x00000003UL) /**< The MUX channel 3 */
#define CY_AUTANALOG_SAR_CHAN_CFG_MUX4                     (0x00000004UL) /**< The MUX channel 4 */
#define CY_AUTANALOG_SAR_CHAN_CFG_MUX5                     (0x00000005UL) /**< The MUX channel 5 */
#define CY_AUTANALOG_SAR_CHAN_CFG_MUX6                     (0x00000006UL) /**< The MUX channel 6 */
#define CY_AUTANALOG_SAR_CHAN_CFG_MUX7                     (0x00000007UL) /**< The MUX channel 7 */
#define CY_AUTANALOG_SAR_CHAN_CFG_MUX8                     (0x00000008UL) /**< The MUX channel 8 */
#define CY_AUTANALOG_SAR_CHAN_CFG_MUX9                     (0x00000009UL) /**< The MUX channel 9 */
#define CY_AUTANALOG_SAR_CHAN_CFG_MUX10                    (0x0000000AUL) /**< The MUX channel 10 */
#define CY_AUTANALOG_SAR_CHAN_CFG_MUX11                    (0x0000000BUL) /**< The MUX channel 11 */
#define CY_AUTANALOG_SAR_CHAN_CFG_MUX12                    (0x0000000CUL) /**< The MUX channel 12 */
#define CY_AUTANALOG_SAR_CHAN_CFG_MUX13                    (0x0000000DUL) /**< The MUX channel 13 */
#define CY_AUTANALOG_SAR_CHAN_CFG_MUX14                    (0x0000000EUL) /**< The MUX channel 14 */
#define CY_AUTANALOG_SAR_CHAN_CFG_MUX15                    (0x0000000FUL) /**< The MUX channel 15 */

/** The MUX channels masks */
#define CY_AUTANALOG_SAR_CHAN_MASK_MUX_DISABLED            (0x00000000UL) /**< Disable usage of MUX channels */
#define CY_AUTANALOG_SAR_CHAN_MASK_MUX0                    (0x00000001UL) /**< The MUX channel 0 */
#define CY_AUTANALOG_SAR_CHAN_MASK_MUX1                    (0x00000002UL) /**< The MUX channel 1 */
#define CY_AUTANALOG_SAR_CHAN_MASK_MUX2                    (0x00000004UL) /**< The MUX channel 2 */
#define CY_AUTANALOG_SAR_CHAN_MASK_MUX3                    (0x00000008UL) /**< The MUX channel 3 */
#define CY_AUTANALOG_SAR_CHAN_MASK_MUX4                    (0x00000010UL) /**< The MUX channel 4 */
#define CY_AUTANALOG_SAR_CHAN_MASK_MUX5                    (0x00000020UL) /**< The MUX channel 5 */
#define CY_AUTANALOG_SAR_CHAN_MASK_MUX6                    (0x00000040UL) /**< The MUX channel 6 */
#define CY_AUTANALOG_SAR_CHAN_MASK_MUX7                    (0x00000080UL) /**< The MUX channel 7 */
#define CY_AUTANALOG_SAR_CHAN_MASK_MUX8                    (0x00000100UL) /**< The MUX channel 8 */
#define CY_AUTANALOG_SAR_CHAN_MASK_MUX9                    (0x00000200UL) /**< The MUX channel 9 */
#define CY_AUTANALOG_SAR_CHAN_MASK_MUX10                   (0x00000400UL) /**< The MUX channel 10 */
#define CY_AUTANALOG_SAR_CHAN_MASK_MUX11                   (0x00000800UL) /**< The MUX channel 11 */
#define CY_AUTANALOG_SAR_CHAN_MASK_MUX12                   (0x00001000UL) /**< The MUX channel 12 */
#define CY_AUTANALOG_SAR_CHAN_MASK_MUX13                   (0x00002000UL) /**< The MUX channel 13 */
#define CY_AUTANALOG_SAR_CHAN_MASK_MUX14                   (0x00004000UL) /**< The MUX channel 14 */
#define CY_AUTANALOG_SAR_CHAN_MASK_MUX15                   (0x00008000UL) /**< The MUX channel 15 */

/** \} group_autanalog_sar_lp_chan_macros */


/** \addtogroup group_autanalog_fir_macros
* \{
*/

/** The FIR filter channels configurations */
#define CY_AUTANALOG_SAR_CFG_FIR0                          (0x00000000UL) /**< The FIR filter 0 */
#define CY_AUTANALOG_SAR_CFG_FIR1                          (0x00000001UL) /**< The FIR filter 1 */

/** The FIR channels masks */
#define CY_AUTANALOG_SAR_MASK_FIR_DISABLED                 (0x00000000UL) /**< Disable usage of FIR filters */
#define CY_AUTANALOG_SAR_MASK_FIR0                         (0x00000001UL) /**< The FIR filter 0 */
#define CY_AUTANALOG_SAR_MASK_FIR1                         (0x00000002UL) /**< The FIR filter 1 */

/** \} group_autanalog_fir_macros */

/** \} group_autanalog_sar_macros */

