PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/include/cy_autanalog_sar.h
/** \addtogroup group_autanalog_fifo_macros
* \{
*/
#define CY_AUTANALOG_FIFO_BUFS_NUM       (8UL)    /**< The maximum number of FIFO buffers */

/** FIFO LEVEL 0 overflow interrupt mask */
#define CY_AUTANALOG_INT_FIFO_OVERFLOW0  (LPPASS_MMIO_FIFO_INTR_CAUSE_FIFO_OVERFLOW0_INT_Msk)
/** FIFO LEVEL 1 overflow interrupt mask */
#define CY_AUTANALOG_INT_FIFO_OVERFLOW1  (LPPASS_MMIO_FIFO_INTR_CAUSE_FIFO_OVERFLOW1_INT_Msk)
/** FIFO LEVEL 2 overflow interrupt mask */
#define CY_AUTANALOG_INT_FIFO_OVERFLOW2  (LPPASS_MMIO_FIFO_INTR_CAUSE_FIFO_OVERFLOW2_INT_Msk)
/** FIFO LEVEL 3 overflow interrupt mask */
#define CY_AUTANALOG_INT_FIFO_OVERFLOW3  (LPPASS_MMIO_FIFO_INTR_CAUSE_FIFO_OVERFLOW3_INT_Msk)
/** FIFO LEVEL 4 overflow interrupt mask */
#define CY_AUTANALOG_INT_FIFO_OVERFLOW4  (LPPASS_MMIO_FIFO_INTR_CAUSE_FIFO_OVERFLOW4_INT_Msk)
/** FIFO LEVEL 5 overflow interrupt mask */
#define CY_AUTANALOG_INT_FIFO_OVERFLOW5  (LPPASS_MMIO_FIFO_INTR_CAUSE_FIFO_OVERFLOW5_INT_Msk)
/** FIFO LEVEL 6 overflow interrupt mask */
#define CY_AUTANALOG_INT_FIFO_OVERFLOW6  (LPPASS_MMIO_FIFO_INTR_CAUSE_FIFO_OVERFLOW6_INT_Msk)
/** FIFO LEVEL 7 overflow interrupt mask */
#define CY_AUTANALOG_INT_FIFO_OVERFLOW7  (LPPASS_MMIO_FIFO_INTR_CAUSE_FIFO_OVERFLOW7_INT_Msk)
/** FIFO LEVEL 0 cause interrupt mask */
#define CY_AUTANALOG_INT_FIFO_LEVEL0     (LPPASS_MMIO_FIFO_INTR_CAUSE_FIFO_LEVEL0_INT_Msk)
/** FIFO LEVEL 1 cause interrupt mask */
#define CY_AUTANALOG_INT_FIFO_LEVEL1     (LPPASS_MMIO_FIFO_INTR_CAUSE_FIFO_LEVEL1_INT_Msk)
/** FIFO LEVEL 2 cause interrupt mask */
#define CY_AUTANALOG_INT_FIFO_LEVEL2     (LPPASS_MMIO_FIFO_INTR_CAUSE_FIFO_LEVEL2_INT_Msk)
/** FIFO LEVEL 3 cause interrupt mask */
#define CY_AUTANALOG_INT_FIFO_LEVEL3     (LPPASS_MMIO_FIFO_INTR_CAUSE_FIFO_LEVEL3_INT_Msk)
/** FIFO LEVEL 4 cause interrupt mask */
#define CY_AUTANALOG_INT_FIFO_LEVEL4     (LPPASS_MMIO_FIFO_INTR_CAUSE_FIFO_LEVEL4_INT_Msk)
/** FIFO LEVEL 5 cause interrupt mask */
#define CY_AUTANALOG_INT_FIFO_LEVEL5     (LPPASS_MMIO_FIFO_INTR_CAUSE_FIFO_LEVEL5_INT_Msk)
/** FIFO LEVEL 6 cause interrupt mask */
#define CY_AUTANALOG_INT_FIFO_LEVEL6     (LPPASS_MMIO_FIFO_INTR_CAUSE_FIFO_LEVEL6_INT_Msk)
/** FIFO LEVEL 7 cause interrupt mask */
#define CY_AUTANALOG_INT_FIFO_LEVEL7     (LPPASS_MMIO_FIFO_INTR_CAUSE_FIFO_LEVEL7_INT_Msk)
/** FIFO LEVEL 0 underflow interrupt mask */
#define CY_AUTANALOG_INT_FIFO_UNDERFLOW0 (LPPASS_MMIO_FIFO_INTR_CAUSE_FIFO_UNDERFLOW0_INT_Msk)
/** FIFO LEVEL 1 underflow interrupt mask */
#define CY_AUTANALOG_INT_FIFO_UNDERFLOW1 (LPPASS_MMIO_FIFO_INTR_CAUSE_FIFO_UNDERFLOW1_INT_Msk)
/** FIFO LEVEL 2 underflow interrupt mask */
#define CY_AUTANALOG_INT_FIFO_UNDERFLOW2 (LPPASS_MMIO_FIFO_INTR_CAUSE_FIFO_UNDERFLOW2_INT_Msk)
/** FIFO LEVEL 3 underflow interrupt mask */
#define CY_AUTANALOG_INT_FIFO_UNDERFLOW3 (LPPASS_MMIO_FIFO_INTR_CAUSE_FIFO_UNDERFLOW3_INT_Msk)
/** FIFO LEVEL 4 underflow interrupt mask */
#define CY_AUTANALOG_INT_FIFO_UNDERFLOW4 (LPPASS_MMIO_FIFO_INTR_CAUSE_FIFO_UNDERFLOW4_INT_Msk)
/** FIFO LEVEL 5 underflow interrupt mask */
#define CY_AUTANALOG_INT_FIFO_UNDERFLOW5 (LPPASS_MMIO_FIFO_INTR_CAUSE_FIFO_UNDERFLOW5_INT_Msk)
/** FIFO LEVEL 6 underflow interrupt mask */
#define CY_AUTANALOG_INT_FIFO_UNDERFLOW6 (LPPASS_MMIO_FIFO_INTR_CAUSE_FIFO_UNDERFLOW6_INT_Msk)
/** FIFO LEVEL 7 underflow interrupt mask */
#define CY_AUTANALOG_INT_FIFO_UNDERFLOW7 (LPPASS_MMIO_FIFO_INTR_CAUSE_FIFO_UNDERFLOW7_INT_Msk)

/** \cond INTERNAL */

/* Combined FIFO interrupt mask */
#define CY_AUTANALOG_INTR_FIFO          (CY_AUTANALOG_INT_FIFO_OVERFLOW0  | \
                                         CY_AUTANALOG_INT_FIFO_OVERFLOW1  | \
                                         CY_AUTANALOG_INT_FIFO_OVERFLOW2  | \
                                         CY_AUTANALOG_INT_FIFO_OVERFLOW3  | \
                                         CY_AUTANALOG_INT_FIFO_OVERFLOW4  | \
                                         CY_AUTANALOG_INT_FIFO_OVERFLOW5  | \
                                         CY_AUTANALOG_INT_FIFO_OVERFLOW6  | \
                                         CY_AUTANALOG_INT_FIFO_OVERFLOW7  | \
                                         CY_AUTANALOG_INT_FIFO_UNDERFLOW0 | \
                                         CY_AUTANALOG_INT_FIFO_UNDERFLOW1 | \
                                         CY_AUTANALOG_INT_FIFO_UNDERFLOW2 | \
                                         CY_AUTANALOG_INT_FIFO_UNDERFLOW3 | \
                                         CY_AUTANALOG_INT_FIFO_UNDERFLOW4 | \
                                         CY_AUTANALOG_INT_FIFO_UNDERFLOW5 | \
                                         CY_AUTANALOG_INT_FIFO_UNDERFLOW6 | \
                                         CY_AUTANALOG_INT_FIFO_UNDERFLOW7 | \
                                         CY_AUTANALOG_INT_FIFO_LEVEL0     | \
                                         CY_AUTANALOG_INT_FIFO_LEVEL1     | \
                                         CY_AUTANALOG_INT_FIFO_LEVEL2     | \
                                         CY_AUTANALOG_INT_FIFO_LEVEL3     | \
                                         CY_AUTANALOG_INT_FIFO_LEVEL4     | \
                                         CY_AUTANALOG_INT_FIFO_LEVEL5     | \
                                         CY_AUTANALOG_INT_FIFO_LEVEL6     | \
                                         CY_AUTANALOG_INT_FIFO_LEVEL7)

/* Validation macros for FIFO registers */
#define CY_AUTANALOG_INTR_FIFO_MASK(interrupt)    (0UL == ((interrupt) & ~CY_AUTANALOG_INTR_FIFO))
#define AUTANALOG_MMIO_FIFO_BUFF_IDX(value)       ((value) < CY_AUTANALOG_FIFO_BUFS_NUM)

/* Validation macros for FIR RESULT STATUS */
#define AUTANALOG_SAR_FIR_STATUS(value)           ((value) <= CY_AUTANALOG_SAR_MASK_FIR1)

/* Helper macros for range validation */
#define AUTANALOG_SAR_FIR_IDX(value)              ((value) < CY_AUTANALOG_SAR_FIR_NUM)
#define AUTANALOG_SAR_INPUT(value)                ((value) <= CY_AUTANALOG_SAR_INPUT_MUX)
#define AUTANALOG_SAR_CHANNEL(key, value)         ((value) < ((key == CY_AUTANALOG_SAR_INPUT_GPIO) ? \
                                                                   PASS_SAR_SAR_GPIO_CHANNELS : \
                                                                   PASS_SAR_SAR_MUX_CHANNELS))

/** \endcond */

/** \} group_autanalog_fifo_macros */


