PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/include/cy_autanalog_sar.h
/* Forward declarations */
__STATIC_INLINE uint32_t Cy_AutAnalog_FIFO_GetInterruptCause(uint8_t fifoIdx);
__STATIC_INLINE uint32_t Cy_AutAnalog_FIFO_GetInterruptStatus(uint8_t fifoIdx);
__STATIC_INLINE void Cy_AutAnalog_FIFO_ClearInterrupt(uint8_t fifoIdx, uint32_t interrupt);
__STATIC_INLINE void Cy_AutAnalog_FIFO_SetInterrupt(uint8_t fifoIdx, uint32_t interrupt);
__STATIC_INLINE void Cy_AutAnalog_FIFO_SetInterruptMask(uint8_t fifoIdx, uint32_t mask);
__STATIC_INLINE uint32_t Cy_AutAnalog_FIFO_GetInterruptMask(uint8_t fifoIdx);
__STATIC_INLINE uint32_t Cy_AutAnalog_FIFO_GetInterruptStatusMasked(uint8_t fifoIdx);


/* Global variables */
extern uint32_t cyAutanalogTempMultiplierHS;
extern uint32_t cyAutanalogTempOffsetHS;
extern uint32_t cyAutanalogTempMultiplierLP;
extern uint32_t cyAutanalogTempOffsetLP;


/***************************************
*       Enumerated Types
***************************************/

/**
* \addtogroup group_autanalog_sar_enums
* \{
*/

/** The ADC input type,
 * for more details, refer to the device Architecture Technical Reference Manual.
 */
typedef enum
{
    CY_AUTANALOG_SAR_INPUT_GPIO = 0U, /**< The GPIO channels */
    CY_AUTANALOG_SAR_INPUT_MUX  = 1U, /**< The MUX channels */

} cy_en_autanalog_sar_input_t;


/** The channel input assignment in ADC HS operating mode,
 * for more details, refer to the device Architecture Technical Reference Manual.
 */
typedef enum
{
    CY_AUTANALOG_SAR_PIN_GPIO0 =  0UL, /**< The GPIO pin 0 */
    CY_AUTANALOG_SAR_PIN_GPIO1 =  1UL, /**< The GPIO pin 1 */
    CY_AUTANALOG_SAR_PIN_GPIO2 =  2UL, /**< The GPIO pin 2 */
    CY_AUTANALOG_SAR_PIN_GPIO3 =  3UL, /**< The GPIO pin 3 */
    CY_AUTANALOG_SAR_PIN_GPIO4 =  4UL, /**< The GPIO pin 4 */
    CY_AUTANALOG_SAR_PIN_GPIO5 =  5UL, /**< The GPIO pin 5 */
    CY_AUTANALOG_SAR_PIN_GPIO6 =  6UL, /**< The GPIO pin 6 */
    CY_AUTANALOG_SAR_PIN_GPIO7 =  7UL, /**< The GPIO pin 7 */

} cy_en_autanalog_sar_pin_hs_t;


/** The channel input assignment in the ADC HS/LP operating mode,
 * for more details, refer to the device Architecture Technical Reference Manual.
 */
typedef enum
{
    CY_AUTANALOG_SAR_PIN_MUX_CTB0_PIN1    =  0UL, /**< The CTB0 GPIO pin 1 */
    CY_AUTANALOG_SAR_PIN_MUX_CTB0_PIN4    =  1UL, /**< The CTB0 GPIO pin 4 */
    CY_AUTANALOG_SAR_PIN_MUX_CTB0_PIN6    =  2UL, /**< The CTB0 GPIO pin 6 */
    CY_AUTANALOG_SAR_PIN_MUX_CTB0_PIN7    =  3UL, /**< The CTB0 GPIO pin 7 */
    CY_AUTANALOG_SAR_PIN_MUX_CTB1_PIN1    =  4UL, /**< The CTB1 GPIO pin 1 */
    CY_AUTANALOG_SAR_PIN_MUX_CTB1_PIN4    =  5UL, /**< The CTB1 GPIO pin 4 */
    CY_AUTANALOG_SAR_PIN_MUX_CTB1_PIN6    =  6UL, /**< The CTB1 GPIO pin 6 */
    CY_AUTANALOG_SAR_PIN_MUX_CTB1_PIN7    =  7UL, /**< The CTB1 GPIO pin 7 */
    CY_AUTANALOG_SAR_PIN_MUX_CTB0_OA0_OUT =  8UL, /**< The CTB0 OpAmp0 output */
    CY_AUTANALOG_SAR_PIN_MUX_CTB0_OA1_OUT =  9UL, /**< The CTB0 OpAmp1 output */
    CY_AUTANALOG_SAR_PIN_MUX_CTB1_OA0_OUT = 10UL, /**< The CTB1 OpAmp0 output */
    CY_AUTANALOG_SAR_PIN_MUX_CTB1_OA1_OUT = 11UL, /**< The CTB1 OpAmp1 output */
    CY_AUTANALOG_SAR_PIN_MUX_DAC0         = 12UL, /**< The DAC0 output  */
    CY_AUTANALOG_SAR_PIN_MUX_DAC1         = 13UL, /**< The DAC1 output  */
    CY_AUTANALOG_SAR_PIN_MUX_TEMP_SENSOR  = 14UL, /**< Temperature sensor */
    CY_AUTANALOG_SAR_PIN_MUX_GPIO0        = 15UL, /**< The GPIO 0 */
    CY_AUTANALOG_SAR_PIN_MUX_GPIO1        = 16UL, /**< The GPIO 1 */
    CY_AUTANALOG_SAR_PIN_MUX_GPIO2        = 17UL, /**< The GPIO 2 */
    CY_AUTANALOG_SAR_PIN_MUX_GPIO3        = 18UL, /**< The GPIO 3 */
    CY_AUTANALOG_SAR_PIN_MUX_GPIO4        = 19UL, /**< The GPIO 4 */
    CY_AUTANALOG_SAR_PIN_MUX_GPIO5        = 20UL, /**< The GPIO 5 */
    CY_AUTANALOG_SAR_PIN_MUX_GPIO6        = 21UL, /**< The GPIO 6 */
    CY_AUTANALOG_SAR_PIN_MUX_GPIO7        = 22UL, /**< The GPIO 7 */
    CY_AUTANALOG_SAR_PIN_MUX_VSSA         = 25UL, /**< The ADC ground */

} cy_en_autanalog_sar_pin_mux_t;


/**
 * The ADC range status selection,
 * defines the selected range conditions for the ADC result.
 * For more details, refer to the device Architecture Technical Reference Manual.
 */
typedef enum
{
    CY_AUTANALOG_SAR_LIMIT_STATUS_DISABLED = 0UL, /**< The limit status is not used */
    CY_AUTANALOG_SAR_LIMIT_STATUS_STC0     = 1UL, /**< The limit status configuration 0 */
    CY_AUTANALOG_SAR_LIMIT_STATUS_STC1     = 2UL, /**< The limit status configuration 1 */
    CY_AUTANALOG_SAR_LIMIT_STATUS_STC2     = 3UL, /**< The limit status configuration 2 */
    CY_AUTANALOG_SAR_LIMIT_STATUS_STC3     = 4UL, /**< The limit status configuration 3 */

} cy_en_autanalog_sar_limit_t;


/**
 * Defines the range detection conditions for the ADC result,
 * refer to cy_stc_autanalog_sar_limit_t.
 * For more details, refer to the device Architecture Technical Reference Manual.
 */
typedef enum
{
    CY_AUTANALOG_SAR_COND_BELOW   = 0UL, /**< result < cy_stc_autanalog_sar_limit_t::low */
    CY_AUTANALOG_SAR_COND_INSIDE  = 1UL, /**< cy_stc_autanalog_sar_limit_t::low <= result AND
                                          *   result < cy_stc_autanalog_sar_limit_t::high */
    CY_AUTANALOG_SAR_COND_ABOVE   = 2UL, /**< result > cy_stc_autanalog_sar_limit_t::high */
    CY_AUTANALOG_SAR_COND_OUTSIDE = 3UL, /**< result < cy_stc_autanalog_sar_limit_t::low OR
                                              result >= cy_stc_autanalog_sar_limit_t::high */
} cy_en_autanalog_sar_cond_t;


/** The ADC channel correction coefficient,
 * for more details, refer to the device Architecture Technical Reference Manual.
 */
typedef enum
{
    CY_AUTANALOG_SAR_CH_COEFF_DISABLED = 0UL, /**< The channel correction coefficient not used */
    CY_AUTANALOG_SAR_CH_COEFF0         = 1UL, /**< The channel correction coefficient configuration 0 */
    CY_AUTANALOG_SAR_CH_COEFF1         = 2UL, /**< The channel correction coefficient configuration 1 */
    CY_AUTANALOG_SAR_CH_COEFF2         = 3UL, /**< The channel correction coefficient configuration 2 */
    CY_AUTANALOG_SAR_CH_COEFF3         = 4UL, /**< The channel correction coefficient configuration 3 */
    CY_AUTANALOG_SAR_CH_COEFF4         = 5UL, /**< The channel correction coefficient configuration 4 */
    CY_AUTANALOG_SAR_CH_COEFF5         = 6UL, /**< The channel correction coefficient configuration 5 */
    CY_AUTANALOG_SAR_CH_COEFF6         = 7UL, /**< The channel correction coefficient configuration 6 */
    CY_AUTANALOG_SAR_CH_COEFF7         = 8UL, /**< The channel correction coefficient configuration 7 */

} cy_en_autanalog_sar_ch_coeff_t;


