PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/include/cy_autanalog_sar.h
/** The ADC reference voltage,
 * for more details, refer to the device Architecture Technical Reference Manual.
 */
typedef enum
{
    CY_AUTANALOG_SAR_VREF_VDDA      = 0UL, /**< The ADC reference is Vdda */
    CY_AUTANALOG_SAR_VREF_EXT       = 1UL, /**< The ADC reference is External.
                                            *  \note In HS mode,
                                            *  connect the bypass capacitor to this pin
                                            *  to hold the charge for the conversion
                                            *  if external VREF is not used.
                                            *  See the device datasheet for the capacitance value
                                            *  and exact location of this pin. */
    CY_AUTANALOG_SAR_VREF_VBGR      = 2UL, /**< The ADC reference is VBGR */
    CY_AUTANALOG_SAR_VREF_VDDA_BY_2 = 3UL, /**< The ADC reference is Vdda/2 */
    CY_AUTANALOG_SAR_VREF_PRB_OUT0  = 4UL, /**< The ADC reference is Vref0 from the PRB0 */
    CY_AUTANALOG_SAR_VREF_PRB_OUT1  = 5UL, /**< The ADC reference is Vref1 from the PRB1 */

} cy_en_autanalog_sar_vref_t;


/** The power modes of the ADC buffers.
 * Each power setting consumes different levels of the current
 * and supports a different input range and gain bandwidth.
 * The charge pump is used to increase the input range to the rails.
 * For more details, refer to the device Architecture Technical Reference Manual.
 */
typedef enum
{
    CY_AUTANALOG_SAR_BUF_PWR_OFF             =  0UL, /**< The power mode for the buffer is OFF,\n
                                                      *   the buffer is disabled */
    CY_AUTANALOG_SAR_BUF_PWR_ULTRA_LOW       =  1UL, /**< The power mode for the buffer is ULTRA LOW,\n
                                                      *   the charge pump is OFF.
                                                      *   The buffer quiescent current is 15uA and
                                                      *   the gain bandwidth is 30kHz; */
    CY_AUTANALOG_SAR_BUF_PWR_ULTRA_LOW_RAIL  =  2UL, /**< The power mode for the buffer is ULTRA LOW,\n
                                                      *   the charge pump is ON.
                                                      *   The buffer quiescent current is 35uA and
                                                      *   the gain bandwidth is 30kHz; */
    CY_AUTANALOG_SAR_BUF_PWR_LOW_RAIL        =  4UL, /**< The power mode for the buffer is LOW,\n
                                                      *   the charge pump is ON.
                                                      *   The buffer quiescent current is 150uA and
                                                      *   the gain bandwidth is 350kHz; */
    CY_AUTANALOG_SAR_BUF_PWR_MEDIUM_RAIL     =  6UL, /**< The power mode for the buffer is MEDIUM,\n
                                                      *   the charge pump is ON.
                                                      *   The buffer quiescent current is 200uA and
                                                      *   the gain bandwidth is 700kHz;
                                                      *   \note This is the recommended operating mode
                                                      *   for ADC channel buffers. */
    CY_AUTANALOG_SAR_BUF_PWR_HIGH_RAIL       =  8UL, /**< The power mode for the buffer is HIGH,\n
                                                      *   the charge pump is ON.
                                                      *   The buffer quiescent current is 600uA and
                                                      *   the gain bandwidth is 1.75MHz; */
    CY_AUTANALOG_SAR_BUF_PWR_ULTRA_HIGH_RAIL = 10UL, /**< The power mode for the buffer is ULTRA HIGH,\n
                                                      *   the charge pump is ON.
                                                      *   The buffer quiescent current is 800uA and
                                                      *   the gain bandwidth is 2.8MHz; */
} cy_en_autanalog_sar_buf_pwr_t;


/** Averaging mode applied to all channels in a scan with averaging enabled,
 * for more details, refer to the device Architecture Technical Reference Manual.
 */
typedef enum
{
    CY_AUTANALOG_SAR_ACC_DISABLED    = 0UL, /**< Average disabled */
    CY_AUTANALOG_SAR_ACC_ACCUNDUMP   = 1UL, /**< Average mode: Accumulate and Dump:\n
                                             *   channels are sampled and accumulated back-to-back */
} cy_en_autanalog_sar_acc_mode_t;


/** The number of samples for averaging,
 * for more details, refer to the device Architecture Technical Reference Manual.
 */
typedef enum
{
    CY_AUTANALOG_SAR_ACC_CNT2   = 0UL, /**< Set samples averaged to 2 */
    CY_AUTANALOG_SAR_ACC_CNT4   = 1UL, /**< Set samples averaged to 4 */
    CY_AUTANALOG_SAR_ACC_CNT8   = 2UL, /**< Set samples averaged to 8 */
    CY_AUTANALOG_SAR_ACC_CNT16  = 3UL, /**< Set samples averaged to 16 */
    CY_AUTANALOG_SAR_ACC_CNT32  = 4UL, /**< Set samples averaged to 32 */
    CY_AUTANALOG_SAR_ACC_CNT64  = 5UL, /**< Set samples averaged to 64 */
    CY_AUTANALOG_SAR_ACC_CNT128 = 6UL, /**< Set samples averaged to 128 */
    CY_AUTANALOG_SAR_ACC_CNT256 = 7UL  /**< Set samples averaged to 256 */

} cy_en_autanalog_sar_acc_cnt_t;


/** The ADC sampling timer,
 * for more details, refer to the device Architecture Technical Reference Manual.
 */
typedef enum
{
    CY_AUTANALOG_SAR_SAMPLE_TIME0 = 0U, /**< Sampling Timer 0 */
    CY_AUTANALOG_SAR_SAMPLE_TIME1 = 1U, /**< Sampling Timer 1 */
    CY_AUTANALOG_SAR_SAMPLE_TIME2 = 2U, /**< Sampling Timer 2 */
    CY_AUTANALOG_SAR_SAMPLE_TIME3 = 3U, /**< Sampling Timer 3 */

} cy_en_autanalog_sar_sample_time_t;


/** The ADC calibration,
 * for more details, refer to the device Architecture Technical Reference Manual.
 */
typedef enum
{
    CY_AUTANALOG_SAR_CAL_DISABLED  = 0UL, /**< Calibration disabled */
    CY_AUTANALOG_SAR_CAL_BOTH      = 1UL, /**< Calibrate both Offset and Linearity */
    CY_AUTANALOG_SAR_CAL_OFFSET    = 2UL, /**< Calibrate Offset only */
    CY_AUTANALOG_SAR_CAL_LINEARITY = 3UL, /**< Calibrate Linearity only */

} cy_en_autanalog_sar_calibrate_t;


/** The Next State for the ADC sequencer while scanning,
 * for more details, refer to the device Architecture Technical Reference Manual.
 */
typedef enum
{
    CY_AUTANALOG_SAR_NEXT_ACTION_STATE_STOP       = 0UL, /**< Stop, send SAR_EOS and SAR_DONE events and idle */
    CY_AUTANALOG_SAR_NEXT_ACTION_GO_TO_ENTRY_ADDR = 1UL, /**< Continuous mode, send SAR_EOS event and return to start */
    CY_AUTANALOG_SAR_NEXT_ACTION_GO_TO_NEXT       = 2UL, /**< Continue to a next state in a given scan */

