PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/include/cy_autanalog_sar.h
} cy_en_autanalog_sar_next_act_t;


/** The FIR filter input channel selection,
 * for more details, refer to the device Architecture Technical Reference Manual.
 */
typedef enum
{
    CY_AUTANALOG_SAR_FIR_CH_DISABLED = 0UL,  /**< The FIR filter input is disabled */
    CY_AUTANALOG_SAR_FIR_CH_GPIO0    = 1UL,  /**< The GPIO channel 0 */
    CY_AUTANALOG_SAR_FIR_CH_GPIO1    = 2UL,  /**< The GPIO channel 1 */
    CY_AUTANALOG_SAR_FIR_CH_GPIO2    = 3UL,  /**< The GPIO channel 2 */
    CY_AUTANALOG_SAR_FIR_CH_GPIO3    = 4UL,  /**< The GPIO channel 3 */
    CY_AUTANALOG_SAR_FIR_CH_GPIO4    = 5UL,  /**< The GPIO channel 4 */
    CY_AUTANALOG_SAR_FIR_CH_GPIO5    = 6UL,  /**< The GPIO channel 5 */
    CY_AUTANALOG_SAR_FIR_CH_GPIO6    = 7UL,  /**< The GPIO channel 6 */
    CY_AUTANALOG_SAR_FIR_CH_GPIO7    = 8UL,  /**< The GPIO channel 7 */
    CY_AUTANALOG_SAR_FIR_CH_MUX0     = 9UL,  /**< The MUX channel  0 */
    CY_AUTANALOG_SAR_FIR_CH_MUX1     = 10UL, /**< The MUX channel  1 */
    CY_AUTANALOG_SAR_FIR_CH_MUX2     = 11UL, /**< The MUX channel  2 */
    CY_AUTANALOG_SAR_FIR_CH_MUX3     = 12UL, /**< The MUX channel  3 */
    CY_AUTANALOG_SAR_FIR_CH_MUX4     = 13UL, /**< The MUX channel  4 */
    CY_AUTANALOG_SAR_FIR_CH_MUX5     = 14UL, /**< The MUX channel  5 */
    CY_AUTANALOG_SAR_FIR_CH_MUX6     = 15UL, /**< The MUX channel  6 */
    CY_AUTANALOG_SAR_FIR_CH_MUX7     = 16UL, /**< The MUX channel  7 */
    CY_AUTANALOG_SAR_FIR_CH_MUX8     = 17UL, /**< The MUX channel  8 */
    CY_AUTANALOG_SAR_FIR_CH_MUX9     = 18UL, /**< The MUX channel  9 */
    CY_AUTANALOG_SAR_FIR_CH_MUX10    = 19UL, /**< The MUX channel  10 */
    CY_AUTANALOG_SAR_FIR_CH_MUX11    = 20UL, /**< The MUX channel  11 */
    CY_AUTANALOG_SAR_FIR_CH_MUX12    = 21UL, /**< The MUX channel  12 */
    CY_AUTANALOG_SAR_FIR_CH_MUX13    = 22UL, /**< The MUX channel  13 */
    CY_AUTANALOG_SAR_FIR_CH_MUX14    = 23UL, /**< The MUX channel  14 */
    CY_AUTANALOG_SAR_FIR_CH_MUX15    = 24UL, /**< The MUX channel  15 */

} cy_en_autanalog_sar_fir_channel_t;


/** \} group_autanalog_sar_enums */


/**
* \addtogroup group_autanalog_fifo_enums
* \{
*/

/** The FIFO selection,
 * for more details, refer to the device Architecture Technical Reference Manual.
 */
typedef enum
{
    CY_AUTANALOG_FIFO_DISABLED = 0UL, /**< DISABLED */
    CY_AUTANALOG_FIFO_SELECT0  = 1UL, /**< FIFO 0 */
    CY_AUTANALOG_FIFO_SELECT1  = 2UL, /**< FIFO 1 */
    CY_AUTANALOG_FIFO_SELECT2  = 3UL, /**< FIFO 2 */
    CY_AUTANALOG_FIFO_SELECT3  = 4UL, /**< FIFO 3 */
    CY_AUTANALOG_FIFO_SELECT4  = 5UL, /**< FIFO 4 */
    CY_AUTANALOG_FIFO_SELECT5  = 6UL, /**< FIFO 5 */
    CY_AUTANALOG_FIFO_SELECT6  = 7UL, /**< FIFO 6 */
    CY_AUTANALOG_FIFO_SELECT7  = 8UL, /**< FIFO 7 */

} cy_en_autanalog_fifo_sel_t;


/** The FIFO configuration,
 * for more details, refer to the device Architecture Technical Reference Manual.
 */
typedef enum
{
    CY_AUTANALOG_FIFO_SPLIT1 = 0UL, /**< The FIFO is a single 512-word buffer */
    CY_AUTANALOG_FIFO_SPLIT2 = 1UL, /**< The FIFO is split into two 256-word buffers */
    CY_AUTANALOG_FIFO_SPLIT4 = 2UL, /**< The FIFO is split into four 128-word buffers */
    CY_AUTANALOG_FIFO_SPLIT8 = 3UL, /**< The FIFO is split into eight 64-word buffers */

} cy_en_autanalog_fifo_split_t;

/** \} group_autanalog_fifo_enums */


/***************************************
*       Configuration Structures
***************************************/

/**
* \addtogroup group_autanalog_fifo_data_structures
* \{
*/


/** The FIFO configuration structure,
 *  refer to \ref group_autanalog_fifo chapter.
 *  Used in \ref cy_stc_autanalog_sar_t and \ref Cy_AutAnalog_FIFO_LoadConfig.
 */
typedef struct
{
    cy_en_autanalog_fifo_split_t split;                             /**< The FIFO split configuration */
    uint16_t                     level[CY_AUTANALOG_FIFO_BUFS_NUM]; /**< Array of the FIFO buffer level settings,
                                                                     *   valid range is 0..511,
                                                                     *   but the real functional range depends on
                                                                     *   the cy_stc_autanalog_fifo_cfg_t::split setting
                                                                     */
} cy_stc_autanalog_fifo_cfg_t;

/** \} group_autanalog_fifo_data_structures */


/**
* \addtogroup group_autanalog_sar_data_structures
* \{
*/

/**
 * The channel range detection configuration structure.
 * Used in \ref cy_stc_autanalog_sar_sta_t.
 */
typedef struct
{
    cy_en_autanalog_sar_cond_t cond; /**< Range detection condition */
    int32_t                    low;  /**< Low threshold for range detection */
    int32_t                    high; /**< High threshold for range detection */

} cy_stc_autanalog_sar_limit_t;


/** The GPIO channel configuration structure,
 *  refer to \ref group_autanalog_sar_ch chapter.
 *  Used in \ref cy_stc_autanalog_sar_sta_hs_t.
 */
typedef struct
{
    cy_en_autanalog_sar_pin_hs_t   posPin;     /**< Positive pin assignment */
    bool                           hsDiffEn;   /**< Enable Pseudo differential mode for the single-ended ADC
                                                *   - FALSE - Pseudo differential mode is disabled;
                                                *   - TRUE - Pseudo differential mode is enabled; */
    bool                           sign;       /**< Output data as a unsigned/signed value,
                                                *   for more details, refer to
                                                *   \ref group_autanalog_sar_sign chapter
                                                *   - FALSE - unsigned number;
                                                *   - TRUE - signed number; */
    cy_en_autanalog_sar_ch_coeff_t posCoeff;   /**< Configuration of the positive input correction coefficient */
    cy_en_autanalog_sar_pin_hs_t   negPin;     /**< The negative pin assignment
                                                      \note Only applicable in Pseudo Differential mode,
                                                      refer to cy_stc_autanalog_sar_hs_chan_t::hsDiffEn */
    bool                           accShift;   /**< Enable the averaging in the HW:
                                                *   Enable the right shift of the accumulated result for
                                                *   cy_stc_autanalog_sar_seq_tab_hs_t::accCount,
                                                *   refer to \ref group_autanalog_sar_avg chapter
                                                *   - FALSE - shift is disabled;
                                                *   - TRUE - shift is enabled; */
    cy_en_autanalog_sar_ch_coeff_t negCoeff;   /**< Configuration of the negative input correction coefficient
                                                      \note Only applicable in Pseudo Differential mode,
                                                      refer to cy_stc_autanalog_sar_hs_chan_t::hsDiffEn */
    cy_en_autanalog_sar_limit_t    hsLimit;    /**< The status selector for the ADC output range */
    cy_en_autanalog_fifo_sel_t     fifoSel;    /**< Define use of FIFO and select buffer if required,
                                                *   refer to \ref group_autanalog_fifo chapter */
} cy_stc_autanalog_sar_hs_chan_t;


/** The MUX channel configuration structure,
 *  refer to \ref group_autanalog_sar_ch chapter.
 *  Used in \ref cy_stc_autanalog_sar_sta_t.
 */
typedef struct
{
    cy_en_autanalog_sar_pin_mux_t  posPin;     /**< Positive pin assignment */
    bool                           sign;       /**< Output data as a unsigned/signed value,
                                                *   for more details, refer to
                                                *   \ref group_autanalog_sar_sign chapter
                                                *   - FALSE - unsigned number;
                                                *   - TRUE - signed number; */
    cy_en_autanalog_sar_ch_coeff_t posCoeff;   /**< Configuration of the positive input correction coefficient */
    cy_en_autanalog_sar_pin_mux_t  negPin;     /**< Negative pin assignment
                                                      \note Only applicable in Low Power mode OR
                                                      in High Speed mode and for MUX channel
                                                      configured in Pseudo Differential mode,
                                                      refer to cy_stc_autanalog_sar_seq_tab_hs_t::muxMode */
    bool                           buffBypass; /**< Bypass MUX channels buffers
                                                *   - FALSE - buffers are enabled;
                                                *   - TRUE - buffers are bypassed; */
    bool                           accShift;   /**< Enable the averaging in the HW:
                                                *   Enable the right shift of the accumulated result for
                                                *   cy_stc_autanalog_sar_seq_tab_lp_t::accCount,
                                                *   refer to \ref group_autanalog_sar_avg chapter
                                                *   - FALSE - shift is disabled;
                                                *   - TRUE - shift is enabled; */
    cy_en_autanalog_sar_ch_coeff_t negCoeff;   /**< Configuration of the negative input correction coefficient
                                                      \note Only applicable in Low Power mode OR
                                                      in High Speed mode and for MUX channel
                                                      configured in Pseudo Differential mode,
                                                      refer to cy_stc_autanalog_sar_seq_tab_hs_t::muxMode */
    cy_en_autanalog_sar_limit_t    muxLimit;   /**< The status selector for the ADC output range */
    cy_en_autanalog_fifo_sel_t     fifoSel;    /**< Define use of FIFO and select buffer if required,
                                                *   refer to \ref group_autanalog_fifo chapter */
} cy_stc_autanalog_sar_mux_chan_t;


/** The part of the Static configuration for ADC HS mode,
 *  refer to \ref group_autanalog_sar_static chapter.
 *  Used in \ref cy_stc_autanalog_sar_sta_t.
 */
typedef struct
{
    cy_en_autanalog_sar_vref_t       hsVref;                                         /**< Select ADC voltage reference,
                                                                                      * refer to \ref group_autanalog_sar_vref chapter */
    uint16_t                         hsSampleTime[CY_AUTANALOG_SAR_SAMPLE_TIME_NUM]; /**< The array of sample time settings represented
                                                                                      *   in clock cycles for ADC HS mode,
                                                                                      *   actual value is SAMPLE_TIME + 1,
                                                                                      *   valid range 1...1024.
                                                                                      * Refer to \ref group_autanalog_sar_sampling chapter.
                                                                                      * \note 5us is the recommended sampling time for
                                                                                      *       Die temperature measurement. */
    cy_stc_autanalog_sar_hs_chan_t *hsGpioChan[PASS_SAR_SAR_GPIO_CHANNELS];         /**< The array of pointers to
                                                                                      *   configuration structures for GPIO channels,
                                                                                      *   NULL means the channel is not configured */
    uint8_t                          hsGpioResultMask;                               /**< GPIO channels result mask,
                                                                                      *  valid range 0x0...0xFF.
                                                                                      * Refer to \ref group_autanalog_sar_result chapter */
} cy_stc_autanalog_sar_sta_hs_t;


