PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/include/cy_autanalog_sar.h
/** The part of the Static configuration for ADC LP mode,
 *  refer to \ref group_autanalog_sar_static chapter.
 *  Used in \ref cy_stc_autanalog_sar_sta_t.
 */
typedef struct
{
    bool                       lpDiffEn;                                       /**< Enable ADC channel differential mode
                                                                                *   - FALSE - differential mode is disabled;
                                                                                *   - TRUE - differential mode is enabled; */
    cy_en_autanalog_sar_vref_t lpVref;                                         /**< Select ADC voltage reference,
                                                                                * refer to \ref group_autanalog_sar_vref chapter */
    uint16_t                   lpSampleTime[CY_AUTANALOG_SAR_SAMPLE_TIME_NUM]; /**< The array of sample time settings represented
                                                                                *   in clock cycles for ADC LP mode,
                                                                                *   actual value is SAMPLE_TIME + 1,
                                                                                *   valid range 1...1024.
                                                                                * Refer to \ref group_autanalog_sar_sampling chapter.
                                                                                * \note 5us is the recommended sampling time for
                                                                                *       Die temperature measurement. */
} cy_stc_autanalog_sar_sta_lp_t;


/** The ADC static configuration structure,
 *  refer to \ref group_autanalog_sar_static chapter.
 *  Used in \ref cy_stc_autanalog_sar_t and \ref Cy_AutAnalog_SAR_LoadStaticConfig.
 */
typedef struct
{
    cy_stc_autanalog_sar_sta_lp_t    *lpStaCfg;                                  /**< LP part of static configuration
                                                                                  *   \note This part is optional,
                                                                                  *    NULL pointer allowed for this field */
    cy_stc_autanalog_sar_sta_hs_t    *hsStaCfg;                                  /**< HS part of static configuration
                                                                                   *   \note This part is optional,
                                                                                   *    NULL pointer allowed for this field */
    cy_en_autanalog_sar_buf_pwr_t     posBufPwr;                                 /**< The power mode of the buffer
                                                                                       in the ADC positive input */
    cy_en_autanalog_sar_buf_pwr_t     negBufPwr;                                 /**< The power mode of the buffer
                                                                                       in the ADC negative input */
    cy_en_autanalog_sar_acc_mode_t    accMode;                                   /**< Enable ADC result averaging and
                                                                                       configure averaging mode,
                                                                                   * refer to \ref group_autanalog_sar_avg chapter */
    cy_en_autanalog_sar_calibrate_t   startupCal;                                /**< Enable the ADC calibration during startup.
                                                                                  *   This field is used to request calibration
                                                                                  *   Process whenever the ADC is powered up
                                                                                  *   (refer to cy_stc_autanalog_stt_sar_t::enable) */
    bool                              chanID;                                    /**< Enable channel number identifier
                                                                                   *  for data stored in FIFO, refer to
                                                                                   * \ref Cy_AutAnalog_FIFO_ReadDataChanId function */
    bool                              shiftMode;                                 /**< Set the resolution of the averaging result
                                                                                   *  if averaging performed by HW,
                                                                                   *  refer to \ref group_autanalog_sar_avg chapter
                                                                                   *   - FALSE - 12 bit;
                                                                                   *   - TRUE - 16 bit; */
    cy_stc_autanalog_sar_mux_chan_t *intMuxChan[PASS_SAR_SAR_MUX_CHANNELS];     /**< The array of pointers to
                                                                                   *  configuration structures for MUX channels,
                                                                                   *  NULL means the channel is not configured */
    cy_stc_autanalog_sar_limit_t     *limitCond[CY_AUTANALOG_SAR_LIMIT_CFG_NUM]; /**< The array of pointers to the
                                                                                   *   configuration structures for the
                                                                                   *   ADC output range detection,
                                                                                   *   a NULL element means that the
                                                                                   *   range detection is not configured */
    uint16_t                          muxResultMask;                             /**< MUX channels result mask,
                                                                                   *  valid range 0x0...0xFFFF.
                                                                                   * Refer to \ref group_autanalog_sar_result chapter */
    uint8_t                           firResultMask;                             /**< FIR filter result mask,
                                                                                   *  valid range 0x0...0x3.
                                                                                   * Refer to \ref group_autanalog_sar_result chapter */
} cy_stc_autanalog_sar_sta_t;


/** The ADC Sequencer Table configuration structure for HS mode,
 *  refer to \ref group_autanalog_sar_sequencer chapter.
 *  Used in \ref cy_stc_autanalog_sar_t and \ref Cy_AutAnalog_SAR_LoadHSseqTable.
 */
typedef struct
{
    uint8_t                           chanEn;       /**< GPIO channels enable mask, valid range 0x0...0xFF,
                                                     *   see \ref group_autanalog_sar_hs_chan_macros macros.
                                                     *   Refer to cy_stc_autanalog_sar_sta_hs_t::hsGpioChan
                                                     *   for channels configurations */
    uint8_t                           muxMode;      /**< Define the operating mode of the MUX channels in HS mode,
                                                     *   see \ref group_autanalog_sar_hs_chan_macros macros */
    uint8_t                           mux0Sel;      /**< MUX 0 channel selection, valid range 0...15,
                                                     *   see \ref group_autanalog_sar_lp_chan_macros macros.
                                                     *   Refer to cy_stc_autanalog_sar_sta_t::intMuxChan
                                                     *   for channel configurations */
    uint8_t                           mux1Sel;      /**< MUX 1 channel selection, valid range 0...15,
                                                     *   see \ref group_autanalog_sar_lp_chan_macros macros.
                                                     *   Refer to cy_stc_autanalog_sar_sta_t::intMuxChan
                                                     *   for channel configurations */
    bool                              sampleTimeEn; /**< Enable the sample time option,
                                                     *   refer to \ref group_autanalog_sar_sampling chapter
                                                     *   - FALSE - ADC sampling is not delayed;
                                                     *   - TRUE - ADC sampling is delayed by the sampling time; */
    cy_en_autanalog_sar_sample_time_t sampleTime;   /**< Sample timer selection.
                                                     *   Select one of the four available sample timers,
                                                     *   see cy_stc_autanalog_sar_sta_hs_t::hsSampleTime */
    bool                              accEn;        /**< Enable the conversion averaging,
                                                     *   refer to \ref group_autanalog_sar_avg chapter
                                                     *   - FALSE - averaging disabled;
                                                     *   - TRUE - averaging enabled; */
    cy_en_autanalog_sar_acc_cnt_t     accCount;     /**< The averaging count for the selected averaging mode,
                                                     *   see cy_stc_autanalog_sar_sta_t::accMode */
    cy_en_autanalog_sar_calibrate_t   calReq;       /**< A real-time calibration channel request.
                                                     *   This request is the signal to the ADC to initiate a real-time
                                                     *   calibration process during an ADC scan. */
    cy_en_autanalog_sar_next_act_t    nextAction;   /**< The ADC sequencer next state,
                                                     *   refer to \ref group_autanalog_sar_sequencer chapter */
} cy_stc_autanalog_sar_seq_tab_hs_t;


