PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/include/cy_autanalog_sar.h
/** The ADC Sequencer Table configuration structure for LP mode,
 *  refer to \ref group_autanalog_sar_sequencer chapter.
 *  Used in \ref cy_stc_autanalog_sar_t and \ref Cy_AutAnalog_SAR_LoadLPseqTable.
 */
typedef struct
{
    bool                              chanEn;       /**< Enable the LP channel
                                                     *   - FALSE - Disable ADC LP channel;
                                                     *   - TRUE - Enable ADC LP channel; */
    uint8_t                           mux0Sel;      /**< MUX 0 channel selection, valid range 0...15.
                                                     *   See \ref group_autanalog_sar_lp_chan_macros macros */
    bool                              sampleTimeEn; /**< Enable the sample time option,
                                                     *   refer to \ref group_autanalog_sar_sampling chapter
                                                     *   - FALSE - ADC sampling is not delayed;
                                                     *   - TRUE - ADC sampling is delayed by the sampling time; */
    cy_en_autanalog_sar_sample_time_t sampleTime;   /**< Sample timer selection.
                                                     *   Select one of the four available sample timers,
                                                     *   see cy_stc_autanalog_sar_sta_lp_t::lpSampleTime */
    bool                              accEn;        /**< Enable the conversion averaging,
                                                     *   refer to \ref group_autanalog_sar_avg chapter
                                                     *   - FALSE - averaging disabled;
                                                     *   - TRUE - averaging enabled; */
    cy_en_autanalog_sar_acc_cnt_t     accCount;     /**< The averaging count for the selected averaging mode,
                                                     *   see cy_stc_autanalog_sar_sta_t::accMode */
    cy_en_autanalog_sar_calibrate_t   calReq;       /**< A real-time calibration channel request.
                                                     *   This request is the signal to the ADC to initiate a real-time
                                                     *   calibration process during an ADC scan. */
    cy_en_autanalog_sar_next_act_t    nextAction;   /**< The ADC sequencer next state,
                                                     *   refer to \ref group_autanalog_sar_sequencer chapter */
} cy_stc_autanalog_sar_seq_tab_lp_t;


/** The FIR filter configuration structure,
 *  refer to \ref group_autanalog_sar_fir chapter.
 *  Used in \ref cy_stc_autanalog_sar_t and \ref Cy_AutAnalog_SAR_LoadFIRconfig.
 */
typedef struct
{
    cy_en_autanalog_sar_fir_channel_t   chanSel;     /**< The logical channel selection for the FIR filter */
    int16_t                            *coeff;       /**< The array of FIR filter coefficients,
                                                      *   the size of the array is defined by defined by
                                                      *   \ref cy_stc_autanalog_sar_fir_cfg_t::tapSel.
                                                      *   Refer to \ref group_autanalog_sar_fir chapter */
    uint8_t                             tapSel;      /**< The tap value,
                                                      *   actual value is TAP_SEL + 1, valid range 1...64 */
    uint8_t                             shiftSel;    /**< FIR filter output scaling:
                                                      *   shift the FIR filter output to the right by the specified number,
                                                      *   valid range 0...16 */
    bool                                waitTapInit; /**< FIR filter output init delay:
                                                      *   wait for a specified number of updates
                                                      *   before outputting first valid data
                                                      *   - FALSE - FIR generates a SAR_FIRx_DONE trigger after each update;
                                                      *   - TRUE - FIR waits for TAP_SEL + 1 updates before triggering; */
    cy_en_autanalog_sar_limit_t         firLimit;    /**< The status selector for the FIR filter output range */
    cy_en_autanalog_fifo_sel_t          fifoSel;     /**< Define use of FIFO and select buffer if required,
                                                      *   refer to \ref group_autanalog_fifo chapter */
} cy_stc_autanalog_sar_fir_cfg_t;


/**
* The configuration structure to set up the entire ADC.
* Used in \ref Cy_AutAnalog_SAR_LoadConfig.
*/
typedef struct
{
    /* Static configuration */
    cy_stc_autanalog_sar_sta_t         *sarStaCfg;   /**< The pointer to a static part of the ADC configuration */

    /* Sequencer table for HS mode */
    uint8_t                             hsSeqTabNum; /**< The number of HS Sequencer Table structures, valid range 0...32 */
    cy_stc_autanalog_sar_seq_tab_hs_t *hsSeqTabArr; /**< Pointer to the array of HS Sequencer Table structures,
                                                      *   the array length is specified by hsSeqTabNum */

    /* Sequencer table for LP mode */
    uint8_t                             lpSeqTabNum; /**< The number of LP Sequencer Table structures, valid range 0...32 */
    cy_stc_autanalog_sar_seq_tab_lp_t *lpSeqTabArr; /**< Pointer to the array of HS Sequencer Table structures,
                                                      *   the array length is specified by lpSeqTabNum */

    /* FIR filter */
    uint8_t                             firNum;      /**< Number of used FIR filters, valid range 0...2 */
    cy_stc_autanalog_sar_fir_cfg_t     *firCfg;      /**< Pointer to the array of FIR filter configuration structures,
                                                      *   the array length is specified by firNum */

    /* FIFO buffer */
    cy_stc_autanalog_fifo_cfg_t        *fifoCfg;     /**< Pointer to the FIFO configuration structure */

