PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/include/cy_autanalog_sar.h
} cy_stc_autanalog_sar_t;


/**
 * The ADC section in the State Transition Table state.
 * Used in \ref cy_stc_autanalog_stt_t.
 */
typedef struct
{
    bool    unlock;     /**< ADC Unlock:
                          * - FALSE - Locked:\n
                          *     Data from fields
                          *     enable, trigger and entryState
                          *     of this structure
                          *     are NOT taken into account in
                          *     the corresponding state of STT;
                          * - TRUE - Unlocked:\n
                          *     Data from fields
                          *     enable, trigger and entryState
                          *     of this structure
                          *     are used in the STT corresponding state;
                          */
    bool    enable;     /**< Enable the ADC */
    bool    trigger;    /**< This field initiates the ADC operation
                          *  per sequencer settings. */
    uint8_t entryState; /**< ADC Sequencer entry state, points to the item of the
                          *   \ref cy_stc_autanalog_sar_t::hsSeqTabArr or
                          *   \ref cy_stc_autanalog_sar_t::lpSeqTabArr depends on the current
                          *   \ref cy_stc_autanalog_stt_ac_t::mode setting,
                          *   the valid range is 0...31
                          */
} cy_stc_autanalog_stt_sar_t;

/** \} group_autanalog_sar_data_structures */


/***************************************
*        Function Prototypes
***************************************/

/**
* \addtogroup group_autanalog_sar_functions
* \{
*/

/**
* \addtogroup group_autanalog_sar_functions_init
* This set of functions is used to configure the ADC.
* \{
*/

/*******************************************************************************
* Function Name: Cy_AutAnalog_SAR_LoadConfig
****************************************************************************//**
*
* Configures the ADC per provided settings.
*
* \note Changing Vref from external to internal (or vice versa) requires a new initialization delay for the ADC subsystem.
* Use a global API \ref Cy_AutAnalog_LoadConfig instead of the local API.
*
* \param sarIdx
* The index of the ADC subsystem within the Autonomous Analog,
* see \ref cy_stc_autanalog_cfg_t::sar.
*
* \param sarCfg
* The pointer to a structure containing static data, Sequencer Table, FIR and FIFO
* configuration structures for the entire ADC subsystem within the Autonomous Analog.
*
* \return
* Status of initialization, \ref cy_en_autanalog_status_t.
*
*******************************************************************************/
cy_en_autanalog_status_t Cy_AutAnalog_SAR_LoadConfig(uint8_t sarIdx, const cy_stc_autanalog_sar_t * sarCfg);


/*******************************************************************************
* Function Name: Cy_AutAnalog_SAR_LoadStaticConfig
****************************************************************************//**
*
* Configures the ADC per settings in the static configuration structure.
*
* \note Changing Vref from external to internal (or vice versa) requires a new initialization delay for the ADC subsystem.
* Use a global API \ref Cy_AutAnalog_LoadConfig instead of the local API.
*
* \param sarIdx
* The index of the ADC subsystem within the Autonomous Analog,
* see \ref cy_stc_autanalog_cfg_t::sar.
*
* \param sarStaCfg
* The pointer to a structure containing static configuration data for the ADC see \ref cy_stc_autanalog_sar_sta_t.
*
* \return
* Status of initialization, \ref cy_en_autanalog_status_t.
*
*******************************************************************************/
cy_en_autanalog_status_t Cy_AutAnalog_SAR_LoadStaticConfig(uint8_t sarIdx, const cy_stc_autanalog_sar_sta_t * sarStaCfg);


/*******************************************************************************
* Function Name: Cy_AutAnalog_SAR_LoadHSseqTable
****************************************************************************//**
*
* Loads the ADC HS Sequencer Table configurations.
*
* \param sarIdx
* The index of the ADC subsystem within the Autonomous Analog,
* see \ref cy_stc_autanalog_cfg_t::sar.
*
* \param seqTabNum
* The number of the ADC HS Sequencer Table configuration structures in the array.
*
* \param seqTabArr
* The pointer to the array of the ADC HS Sequencer Table configuration structures,
* see \ref cy_stc_autanalog_sar_seq_tab_hs_t.
*
* \return
* Status of initialization, \ref cy_en_autanalog_status_t.
*
*******************************************************************************/
cy_en_autanalog_status_t Cy_AutAnalog_SAR_LoadHSseqTable(uint8_t sarIdx, uint8_t seqTabNum,
        const cy_stc_autanalog_sar_seq_tab_hs_t *seqTabArr);


/*******************************************************************************
* Function Name: Cy_AutAnalog_SAR_LoadLPseqTable
****************************************************************************//**
*
* Loads the ADC LP Sequencer Table configurations.
*
* \param sarIdx
* The index of the ADC subsystem within the Autonomous Analog,
* see \ref cy_stc_autanalog_cfg_t::sar.
*
* \param seqTabNum
* The number of the ADC LP Sequencer Table configuration structures in the array.
*
* \param seqTabArr
* The pointer to the array of the ADC LP Sequencer Table configuration structures,
* see \ref cy_stc_autanalog_sar_seq_tab_lp_t.
*
* \return
* Status of initialization, \ref cy_en_autanalog_status_t.
*
*******************************************************************************/
cy_en_autanalog_status_t Cy_AutAnalog_SAR_LoadLPseqTable(uint8_t sarIdx, uint8_t seqTabNum,
        const cy_stc_autanalog_sar_seq_tab_lp_t *seqTabArr);


/*******************************************************************************
* Function Name: Cy_AutAnalog_SAR_LoadFIRconfig
****************************************************************************//**
*
* Loads the ADC FIR filter configurations.
*
* \param sarIdx
* The index of the ADC subsystem within the Autonomous Analog,
* see \ref cy_stc_autanalog_cfg_t::sar.
*
* \param firIdx
* The index of the FIR filter within the ADC,
* see \ref cy_stc_autanalog_sar_t::firNum.
*
* \param firCfg
* The pointer to the array of the FIR filter configuration structures,
* see \ref cy_stc_autanalog_sar_t::firCfg.
*
* \return
* Status of initialization, \ref cy_en_autanalog_status_t.
*
*******************************************************************************/
cy_en_autanalog_status_t Cy_AutAnalog_SAR_LoadFIRconfig(uint8_t sarIdx, uint8_t firIdx,
        const cy_stc_autanalog_sar_fir_cfg_t *firCfg);

/** \} group_autanalog_sar_functions_init */


/**
* \addtogroup group_autanalog_sar_functions_status
* \{
*/

