PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/include/cy_autanalog_sar.h
/*******************************************************************************
* Function Name: Cy_AutAnalog_SAR_GetHSchanLimitStatus
****************************************************************************//**
*
* Provides the range detect status for the ADC GPIO channels.
* The ADC sets this bit for each channel when the conversion result (or averaging result)
* of that channel meets the condition specified by the \ref cy_stc_autanalog_sar_hs_chan_t::hsLimit
* and configured in \ref cy_stc_autanalog_sar_sta_t::limitCond.
*
* \param sarIdx
* The index of the ADC subsystem within the Autonomous Analog,
* see \ref cy_stc_autanalog_cfg_t::sar.
*
* \return
* The range detect status for the GPIO channels.
* Compare this value with one of the masks for the GPIO channels.
* \note Under invalid ADC index, "zero" returns in the result.
*
*******************************************************************************/
__STATIC_INLINE uint8_t Cy_AutAnalog_SAR_GetHSchanLimitStatus(uint8_t sarIdx)
{
    uint32_t baseAddr;

    return CY_AUTANALOG_SUCCESS == Cy_AutAnalog_IdxToBaseAddr(CY_AUTANALOG_SAR, sarIdx, &baseAddr) ?
           (uint8_t)_FLD2VAL(SAR_STA_RANGE_STATUS_GPIO_CHAN_RANGE_STATUS, AUTANALOG_SAR_RANGE_STATUS(baseAddr)) : 0U;
}


/*******************************************************************************
* Function Name: Cy_AutAnalog_SAR_ClearHSchanLimitStatus
****************************************************************************//**
*
* Clears the range detect status for the ADC GPIO channels.
* See \ref Cy_AutAnalog_SAR_GetHSchanLimitStatus
*
* \param sarIdx
* The index of the ADC subsystem within the Autonomous Analog,
* see \ref cy_stc_autanalog_cfg_t::sar.
* \note Under invalid ADC index, the function has no effect.
*
* \param chMask
* The combined mask for the GPIO channels that require a reset of their range detection status.
*
*******************************************************************************/
__STATIC_INLINE void Cy_AutAnalog_SAR_ClearHSchanLimitStatus(uint8_t sarIdx, uint8_t chMask)
{
    uint32_t baseAddr;

    if (CY_AUTANALOG_SUCCESS == Cy_AutAnalog_IdxToBaseAddr(CY_AUTANALOG_SAR, sarIdx, &baseAddr))
    {
        AUTANALOG_SAR_RANGE_STATUS(baseAddr) = _VAL2FLD(SAR_STA_RANGE_STATUS_GPIO_CHAN_RANGE_STATUS, chMask);
    }
}


/*******************************************************************************
* Function Name: Cy_AutAnalog_SAR_GetHSchanResultStatus
****************************************************************************//**
*
* Provides the result updated status for the ADC GPIO channels.
* The ADC sets this bit for each channel if that particular channel was sampled during the previous scan
* and reached the averaging count.
*
* \param sarIdx
* The index of the ADC subsystem within the Autonomous Analog,
* see \ref cy_stc_autanalog_cfg_t::sar.
*
* \return
* The result update status for the GPIO channels.
* Compare this value with one of the masks for the GPIO channels.
* \note Under invalid ADC index, "zero" returns in the result.
*
*******************************************************************************/
__STATIC_INLINE uint8_t Cy_AutAnalog_SAR_GetHSchanResultStatus(uint8_t sarIdx)
{
    uint32_t baseAddr;

    return CY_AUTANALOG_SUCCESS == Cy_AutAnalog_IdxToBaseAddr(CY_AUTANALOG_SAR, sarIdx, &baseAddr) ?
           (uint8_t)_FLD2VAL(SAR_STA_CHAN_RESULT_UPDATED_GPIO_CHAN_RESULT_UPDATED, AUTANALOG_SAR_CHAN_RESULT_STATUS(baseAddr)) : 0U;
}


/*******************************************************************************
* Function Name: Cy_AutAnalog_SAR_ClearHSchanResultStatus
****************************************************************************//**
*
* Clears the result update status for the ADC GPIO channels.
* See \ref Cy_AutAnalog_SAR_GetHSchanResultStatus
*
* \param sarIdx
* The index of the ADC subsystem within the Autonomous Analog,
* see \ref cy_stc_autanalog_cfg_t::sar.
* \note Under invalid ADC index, the function has no effect.
*
* \param chMask
* The combined mask for the GPIO channels that require a reset of their result update status.
*
*******************************************************************************/
__STATIC_INLINE void Cy_AutAnalog_SAR_ClearHSchanResultStatus(uint8_t sarIdx, uint8_t chMask)
{
    uint32_t baseAddr;

    if (CY_AUTANALOG_SUCCESS == Cy_AutAnalog_IdxToBaseAddr(CY_AUTANALOG_SAR, sarIdx, &baseAddr))
    {
        AUTANALOG_SAR_CHAN_RESULT_STATUS(baseAddr) = _VAL2FLD(SAR_STA_CHAN_RESULT_UPDATED_GPIO_CHAN_RESULT_UPDATED, chMask);
    }
}


/*******************************************************************************
* Function Name: Cy_AutAnalog_SAR_GetMuxChanLimitStatus
****************************************************************************//**
*
* Provides the range detect status for the ADC MUX channels.
* The ADC sets this bit for each channel when the conversion result (or averaging result)
* of that channel meets the condition specified by the \ref cy_stc_autanalog_sar_mux_chan_t::muxLimit
* and configured in \ref cy_stc_autanalog_sar_sta_t::limitCond.
*
* \param sarIdx
* The index of the ADC subsystem within the Autonomous Analog,
* see \ref cy_stc_autanalog_cfg_t::sar.
*
* \return
* The range detect status for the MUX channels.
* Compare this value with one of the masks for the MUX channels.
* \note Under invalid ADC index, "zero" returns in the result.
*
*******************************************************************************/
__STATIC_INLINE uint16_t Cy_AutAnalog_SAR_GetMuxChanLimitStatus(uint8_t sarIdx)
{
    uint32_t baseAddr;

    return CY_AUTANALOG_SUCCESS == Cy_AutAnalog_IdxToBaseAddr(CY_AUTANALOG_SAR, sarIdx, &baseAddr) ?
           (uint16_t)_FLD2VAL(SAR_STA_RANGE_STATUS_MUX_CHAN_RANGE_STATUS, AUTANALOG_SAR_RANGE_STATUS(baseAddr)) : 0U;
}


/*******************************************************************************
* Function Name: Cy_AutAnalog_SAR_ClearMuxChanLimitStatus
****************************************************************************//**
*
* Clears the range detect status for the ADC MUX channels.
* See \ref Cy_AutAnalog_SAR_GetMuxChanLimitStatus
*
* \param sarIdx
* The index of the ADC subsystem within the Autonomous Analog,
* see \ref cy_stc_autanalog_cfg_t::sar.
* \note Under invalid ADC index, the function has no effect.
*
* \param chMask
* The combined mask for MUX channels that require a reset of their range detect status.
*
*******************************************************************************/
__STATIC_INLINE void Cy_AutAnalog_SAR_ClearMuxChanLimitStatus(uint8_t sarIdx, uint16_t chMask)
{
    uint32_t baseAddr;

    if (CY_AUTANALOG_SUCCESS == Cy_AutAnalog_IdxToBaseAddr(CY_AUTANALOG_SAR, sarIdx, &baseAddr))
    {
        AUTANALOG_SAR_RANGE_STATUS(baseAddr) = _VAL2FLD(SAR_STA_RANGE_STATUS_MUX_CHAN_RANGE_STATUS, chMask);
    }
}


