PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/include/cy_autanalog_sar.h
/*******************************************************************************
* Function Name: Cy_AutAnalog_SAR_GetMuxChanResultStatus
****************************************************************************//**
*
* Provides a result updated status for the ADC MUX channels.
* The ADC sets this bit for each channel if that particular channel was sampled during the previous scan
* and reached the averaging count.
*
* \param sarIdx
* The index of the ADC subsystem within the Autonomous Analog,
* see \ref cy_stc_autanalog_cfg_t::sar.
*
* \return
* The result update status for the MUX channels.
* Compare this value with one of the masks for the MUX channels.
* \note Under invalid ADC index, "zero" returns in the result.
*
*******************************************************************************/
__STATIC_INLINE uint16_t Cy_AutAnalog_SAR_GetMuxChanResultStatus(uint8_t sarIdx)
{
    uint32_t baseAddr;

    return CY_AUTANALOG_SUCCESS == Cy_AutAnalog_IdxToBaseAddr(CY_AUTANALOG_SAR, sarIdx, &baseAddr) ?
           (uint16_t)_FLD2VAL(SAR_STA_CHAN_RESULT_UPDATED_MUX_CHAN_RESULT_UPDATED, AUTANALOG_SAR_CHAN_RESULT_STATUS(baseAddr)) : 0U;
}


/*******************************************************************************
* Function Name: Cy_AutAnalog_SAR_ClearMuxChanResultStatus
****************************************************************************//**
*
* Clears the result update status for the ADC MUX channels.
* See \ref Cy_AutAnalog_SAR_GetMuxChanResultStatus
*
* \param sarIdx
* The index of the ADC subsystem within the Autonomous Analog,
* see \ref cy_stc_autanalog_cfg_t::sar.
* \note Under invalid ADC index, the function has no effect.
*
* \param chMask
* The combined mask for the MUX channels that require a reset of their result update status.
*
*******************************************************************************/
__STATIC_INLINE void Cy_AutAnalog_SAR_ClearMuxChanResultStatus(uint8_t sarIdx, uint16_t chMask)
{
    uint32_t baseAddr;

    if (CY_AUTANALOG_SUCCESS == Cy_AutAnalog_IdxToBaseAddr(CY_AUTANALOG_SAR, sarIdx, &baseAddr))
    {
        AUTANALOG_SAR_CHAN_RESULT_STATUS(baseAddr) = _VAL2FLD(SAR_STA_CHAN_RESULT_UPDATED_MUX_CHAN_RESULT_UPDATED, chMask);
    }
}

/** \} group_autanalog_sar_functions_status */


/**
* \addtogroup group_autanalog_sar_functions_fir
* \{
*/

/*******************************************************************************
* Function Name: Cy_AutAnalog_SAR_FIRgetLimitStatus
****************************************************************************//**
*
* Provides the range detect status for the ADC FIR filter output.
* The ADC sets this bit for each FIR filter when the filtering result
* meets the condition specified by the \ref cy_stc_autanalog_sar_fir_cfg_t::firLimit
* and configured in \ref cy_stc_autanalog_sar_sta_t::limitCond.
*
* \param sarIdx
* The index of the ADC subsystem within the Autonomous Analog,
* see \ref cy_stc_autanalog_cfg_t::sar.
*
* \return
* The range detect status for the ADC FIR filter output.
* Compare this value with one of the masks for the FIR filters.
* \note Under invalid ADC index, "zero" returns in the result.
*
*******************************************************************************/
__STATIC_INLINE uint8_t Cy_AutAnalog_SAR_FIRgetLimitStatus(uint8_t sarIdx)
{
    uint32_t baseAddr;

    return CY_AUTANALOG_SUCCESS == Cy_AutAnalog_IdxToBaseAddr(CY_AUTANALOG_SAR, sarIdx, &baseAddr) ?
           (uint8_t)_FLD2VAL(SAR_STA_RANGE_STATUS_FIR_RANGE_STATUS, AUTANALOG_SAR_RANGE_STATUS(baseAddr)) : 0U;
}


/*******************************************************************************
* Function Name: Cy_AutAnalog_SAR_FIRclearLimitStatus
****************************************************************************//**
*
* Clears the range detect status for the ADC FIR filters.
* See \ref Cy_AutAnalog_SAR_FIRgetLimitStatus
*
* \param sarIdx
* The index of the ADC subsystem within the Autonomous Analog,
* see \ref cy_stc_autanalog_cfg_t::sar.
* \note Under invalid ADC index, the function has no effect.
*
* \param firMask
* The combined mask for the FIR filters that require a reset of their range detect status.
*
*******************************************************************************/
__STATIC_INLINE void Cy_AutAnalog_SAR_FIRclearLimitStatus(uint8_t sarIdx, uint8_t firMask)
{
    uint32_t baseAddr;

    CY_ASSERT_L2(AUTANALOG_SAR_FIR_STATUS(firMask));

    if (CY_AUTANALOG_SUCCESS == Cy_AutAnalog_IdxToBaseAddr(CY_AUTANALOG_SAR, sarIdx, &baseAddr))
    {
        AUTANALOG_SAR_RANGE_STATUS(baseAddr) = _VAL2FLD(SAR_STA_RANGE_STATUS_FIR_RANGE_STATUS, firMask);
    }
}


/*******************************************************************************
* Function Name: Cy_AutAnalog_SAR_FIRgetResultStatus
****************************************************************************//**
*
* Provides the result updated status for the FIR filter output.
* The ADC sets this bit for each FIR filter when the filter result is updated.
*
* \param sarIdx
* The index of the ADC subsystem within the Autonomous Analog,
* see \ref cy_stc_autanalog_cfg_t::sar.
*
* \return
* The result update status for the FIR filter output.
* Compare this value with one of the masks for the FIR filters.
* \note Under invalid ADC index, "zero" returns in the result.
*
*******************************************************************************/
__STATIC_INLINE uint8_t Cy_AutAnalog_SAR_FIRgetResultStatus(uint8_t sarIdx)
{
    uint32_t baseAddr;

    return CY_AUTANALOG_SUCCESS == Cy_AutAnalog_IdxToBaseAddr(CY_AUTANALOG_SAR, sarIdx, &baseAddr) ?
           (uint8_t)_FLD2VAL(SAR_STA_FIR_RESULT_UPDATED_FIR_RESULT_UPDATED, AUTANALOG_SAR_FIR_RESULT_STATUS(baseAddr)) : 0U;
}


/*******************************************************************************
* Function Name: Cy_AutAnalog_SAR_FIRclearResultStatus
****************************************************************************//**
*
* Clears the result update status for the ADC FIR filter output.
* See \ref Cy_AutAnalog_SAR_FIRgetResultStatus
*
* \param sarIdx
* The index of the ADC subsystem within the Autonomous Analog,
* see \ref cy_stc_autanalog_cfg_t::sar.
* \note Under invalid ADC index, the function has no effect.
*
* \param firMask
* The combined mask for the FIR filters that require a reset of their result update status.
*
*******************************************************************************/
__STATIC_INLINE void Cy_AutAnalog_SAR_FIRclearResultStatus(uint8_t sarIdx, uint8_t firMask)
{
    uint32_t baseAddr;

