PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/include/cy_autanalog_sar.h
    CY_ASSERT_L2(AUTANALOG_SAR_FIR_STATUS(firMask));

    if (CY_AUTANALOG_SUCCESS == Cy_AutAnalog_IdxToBaseAddr(CY_AUTANALOG_SAR, sarIdx, &baseAddr))
    {
        AUTANALOG_SAR_FIR_RESULT_STATUS(baseAddr) = _VAL2FLD(SAR_STA_FIR_RESULT_UPDATED_FIR_RESULT_UPDATED, firMask);
    }
}


/*******************************************************************************
* Function Name: Cy_AutAnalog_SAR_FIRreadResult
****************************************************************************//**
*
* Provides an FIR filter result.
*
* \param sarIdx
* The index of the ADC subsystem within the Autonomous Analog,
* see \ref cy_stc_autanalog_cfg_t::sar.
*
* \param firIdx
* The index of the FIR filter within the ADC,
* see \ref cy_stc_autanalog_sar_t::firNum.
*
* \return
* The FIR filter output data.
* \note Under invalid ADC index, "zero" returns in the result.
*
*******************************************************************************/
__STATIC_INLINE int32_t Cy_AutAnalog_SAR_FIRreadResult(uint8_t sarIdx, uint8_t firIdx)
{
    uint32_t baseAddr;

    CY_ASSERT_L2(AUTANALOG_SAR_FIR_IDX(firIdx));

    CY_MISRA_DEVIATE_BLOCK_START('MISRA C-2012 Rule 10.8', 1, 'Review shows that type conversion from unsigned to signed does not have any negative drawbacks');
    return CY_AUTANALOG_SUCCESS == Cy_AutAnalog_IdxToBaseAddr(CY_AUTANALOG_SAR, sarIdx, &baseAddr) ?
           (int32_t)_FLD2VAL(SAR_STA_FIR_RESULT_RESULT, AUTANALOG_SAR_FIR_RESULT(baseAddr, firIdx)) : 0;
    CY_MISRA_BLOCK_END('MISRA C-2012 Rule 10.8');
}

/*******************************************************************************
* Function Name: Cy_AutAnalog_SAR_FIRloadCoeff
****************************************************************************//**
*
* Loads the ADC FIR filter coefficients.
*
* \param sarIdx
* The index of the ADC subsystem within the Autonomous Analog,
* see \ref cy_stc_autanalog_cfg_t::sar.
*
* \param firIdx
* The index of the FIR filter within the ADC,
* see \ref cy_stc_autanalog_sar_t::firNum.
*
* \param firCoeffNum
* The number of the FIR filter coefficients in the array.
*
* \param firCoeffArr
* The pointer to the array of the FIR filter coefficients.
*
* \return
* Status of execution, \ref cy_en_autanalog_status_t.
*
*******************************************************************************/
cy_en_autanalog_status_t Cy_AutAnalog_SAR_FIRloadCoeff(uint8_t sarIdx, uint8_t firIdx, uint8_t firCoeffNum,
        const int16_t *firCoeffArr);

/** \} group_autanalog_sar_functions_fir */


/*******************************************************************************
* Function Name: Cy_AutAnalog_SAR_LoadOffsetGainCorr
****************************************************************************//**
*
* Loads the offset and gain correction coefficients for the ADC channels.
* \note Only the eight channels of the ADC can be corrected.
* \note Refer to \ref cy_stc_autanalog_sar_hs_chan_t::posCoeff and cy_stc_autanalog_sar_hs_chan_t::negCoeff
* OR to \ref cy_stc_autanalog_sar_mux_chan_t::posCoeff and cy_stc_autanalog_sar_mux_chan_t::negCoeff
*
* \param sarIdx
* The index of the ADC subsystem within the Autonomous Analog,
* see \ref cy_stc_autanalog_cfg_t::sar.
*
* \param chanGain
* The array of gain correction coefficients
* for the eight channels of the ADC.
*
* \note The default value of Gain Correction Coefficient is 1.\n
*       This parameter is intended to correct sources of the gain error in the ADC channel (from the GPIO to the ADC input).\n
*       Multiplies the 12-bit ADC conversion by X.XXXXXXXXXXXXXXX\n
*       Range: 1/2^15 = (0.000030517578125) to 2 - (1/2^15) = (1.999969482421875)
*
* \param chanOffset
* The array of offset correction coefficients
* for the eight channels of the ADC.
*
* \note Default value of Offset Correction Coefficient is 0.\n
*       This parameter is intended to correct sources of the offset error in the ADC channel (from the GPIO to the ADC input).\n
*       The signed offset values range from -2048 (0x800) to +2047 (0x7FF) is added to the 12-bit ADC conversion.
*
* \return
* Status of initialization, \ref cy_en_autanalog_status_t.
*
*******************************************************************************/
cy_en_autanalog_status_t Cy_AutAnalog_SAR_LoadOffsetGainCorr(uint8_t sarIdx, uint16_t chanGain[], int16_t chanOffset[]);


/**
* \addtogroup group_autanalog_sar_functions_conv
* \{
*/

/*******************************************************************************
* Function Name: Cy_AutAnalog_SAR_IsBusy
****************************************************************************//**
*
* Provides the status of the ADC conversion execution at the time of the request.
*
* \note This bit is always high in Continuous mode.
* (i.e. the next state in a scan is set to \ref cy_en_autanalog_sar_next_act_t::CY_AUTANALOG_SAR_NEXT_ACTION_GO_TO_ENTRY_ADDR).
* Except for Continuous mode, the firmware waits for this bit to be low before powering down the ADC
* (cy_stc_autanalog_stt_sar_t::enable = FALSE).
*
* \param sarIdx
* The index of the ADC subsystem within the Autonomous Analog,
* see \ref cy_stc_autanalog_cfg_t::sar.
*
* \return
* The status of the ADC conversion.
* \note Under invalid ADC index, "false" returns in the result.
*
*******************************************************************************/
__STATIC_INLINE bool Cy_AutAnalog_SAR_IsBusy(uint8_t sarIdx)
{
    uint32_t baseAddr;

    return CY_AUTANALOG_SUCCESS == Cy_AutAnalog_IdxToBaseAddr(CY_AUTANALOG_SAR, sarIdx, &baseAddr) ?
           (bool)_FLD2VAL(SAR_STA_STATUS_BUSY, AUTANALOG_SAR_STATUS(baseAddr)) : false;
}


/*******************************************************************************
* Function Name: Cy_AutAnalog_SAR_ReadResult
****************************************************************************//**
*
* Provides the conversion data for the dedicated channel.
*
* \param sarIdx
* The index of the ADC subsystem within the Autonomous Analog,
* see \ref cy_stc_autanalog_cfg_t::sar.
*
* \param input
* The ADC input type is either GPIO or MUX.
*
* \param channel
* The ADC channel for conversion
*  - valid range for the GPIO: 0...7;
*  - valid range for the MUX: 0...15;
*
* \return
* The result of the ADC.
* \note Under invalid ADC index, "zero" returns in the result.
*
*******************************************************************************/
__STATIC_INLINE int32_t Cy_AutAnalog_SAR_ReadResult(uint8_t sarIdx, cy_en_autanalog_sar_input_t input, uint8_t channel)
{
    uint32_t baseAddr;
    int32_t regVal = 0;

    CY_ASSERT_L2(AUTANALOG_SAR_INPUT(input));
    CY_ASSERT_L2(AUTANALOG_SAR_CHANNEL(input, channel));

    if (CY_AUTANALOG_SUCCESS == Cy_AutAnalog_IdxToBaseAddr(CY_AUTANALOG_SAR, sarIdx, &baseAddr))
    {
        CY_MISRA_DEVIATE_BLOCK_START('MISRA C-2012 Rule 10.8', 2, 'Review shows that type conversion from unsigned to signed does not have any negative drawbacks');
        regVal = (input == CY_AUTANALOG_SAR_INPUT_GPIO) ?
                 (int32_t)_FLD2VAL(SAR_STA_GPIO_CHAN_RESULT_RESULT, AUTANALOG_SAR_GPIO_CHAN_RESULT(baseAddr, channel)) :
                 (int32_t)_FLD2VAL(SAR_STA_MUX_CHAN_RESULT_RESULT, AUTANALOG_SAR_MUX_CHAN_RESULT(baseAddr, channel));
        CY_MISRA_BLOCK_END('MISRA C-2012 Rule 10.8');
    }

    return regVal;
}


