PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/include/cy_autanalog_sar.h
/*******************************************************************************
* Function Name: Cy_AutAnalog_SAR_CountsTo_Volts
****************************************************************************//**
*
* Converts the ADC output to Volts.
*
* \param sarIdx
* The index of the ADC subsystem within the Autonomous Analog,
* see \ref cy_stc_autanalog_cfg_t::sar.
*
* \param sarLP
* The operating mode of the ADC
* - FALSE - High Speed;
* - TRUE - Low Power;
*
* \param sarSequencer
* The ADC sequencer to convert the output data to Volts,
* valid range 0...31.
*
* \param sarInput
* The ADC input type is either GPIO or MUX.
*
* \param sarChannel
* The ADC channel for conversion
*  - valid range for the GPIO: 0...7;
*  - valid range for the MUX: 0...15;
*
* \param VrefmV
* The ADC reference voltage in mV.
*
* \param sarCounts
* The conversion result, see \ref Cy_AutAnalog_SAR_ReadResult.
* If conversion data is received from FIFO, see \ref Cy_AutAnalog_FIFO_ReadWord
* (\ref Cy_AutAnalog_FIFO_ReadAllData, \ref Cy_AutAnalog_FIFO_ReadDataChanId).
*
* \return
* The ADC result in Volts.
* \note Under invalid ADC index, "zero" returns in the result.
*
*******************************************************************************/
float32_t Cy_AutAnalog_SAR_CountsTo_Volts(uint8_t sarIdx, bool sarLP, uint8_t sarSequencer, cy_en_autanalog_sar_input_t sarInput,
        uint8_t sarChannel, uint32_t VrefmV, int32_t sarCounts);


/*******************************************************************************
* Function Name: Cy_AutAnalog_SAR_CountsTo_mVolts
****************************************************************************//**
*
* Converts the ADC output to miliVolts.
*
* \param sarIdx
* The index of the ADC subsystem within the Autonomous Analog,
* see \ref cy_stc_autanalog_cfg_t::sar.
*
* \param sarLP
* The operating mode of the ADC
* - FALSE - High Speed;
* - TRUE - Low Power;
*
* \param sarSequencer
* The ADC sequencer to convert the output data to miliVolts,
* valid range 0...31.
*
* \param sarInput
* The ADC input type is either GPIO or MUX.
*
* \param sarChannel
* The ADC channel for conversion
*  - valid range for the GPIO: 0...7;
*  - valid range for the MUX: 0...15;
*
* \param VrefmV
* The ADC reference voltage in mV.
*
* \param sarCounts
* The conversion result, see \ref Cy_AutAnalog_SAR_ReadResult.
* If conversion data is received from FIFO, see \ref Cy_AutAnalog_FIFO_ReadWord
* (\ref Cy_AutAnalog_FIFO_ReadAllData, \ref Cy_AutAnalog_FIFO_ReadDataChanId).
*
* \return
* The ADC result in miliVolts.
* \note Under invalid ADC index, "zero" returns in the result.
*
*******************************************************************************/
int16_t Cy_AutAnalog_SAR_CountsTo_mVolts(uint8_t sarIdx, bool sarLP, uint8_t sarSequencer, cy_en_autanalog_sar_input_t sarInput,
        uint8_t sarChannel, uint32_t VrefmV, int32_t sarCounts);


/*******************************************************************************
* Function Name: Cy_AutAnalog_SAR_CountsTo_uVolts
****************************************************************************//**
*
* Converts the ADC output to microVolts.
*
* \param sarIdx
* The index of the ADC subsystem within the Autonomous Analog,
* see \ref cy_stc_autanalog_cfg_t::sar.
*
* \param sarLP
* The operating mode of the ADC
* - FALSE - High Speed;
* - TRUE - Low Power;
*
* \param sarSequencer
* The ADC sequencer to convert the output data to microVolts,
* valid range 0...31.
*
* \param sarInput
* The ADC input type is either GPIO or MUX.
*
* \param sarChannel
* The ADC channel for conversion
*  - valid range for the GPIO: 0...7;
*  - valid range for the MUX: 0...15;
*
* \param VrefmV
* The ADC reference voltage in mV.
*
* \param sarCounts
* The conversion result, see \ref Cy_AutAnalog_SAR_ReadResult.
* If conversion data is received from FIFO, see \ref Cy_AutAnalog_FIFO_ReadWord
* (\ref Cy_AutAnalog_FIFO_ReadAllData, \ref Cy_AutAnalog_FIFO_ReadDataChanId).
*
* \return
* The ADC result in microVolts.
* \note Under invalid ADC index, "zero" returns in the result.
*
*******************************************************************************/
int32_t Cy_AutAnalog_SAR_CountsTo_uVolts(uint8_t sarIdx, bool sarLP, uint8_t sarSequencer, cy_en_autanalog_sar_input_t sarInput,
        uint8_t sarChannel, uint32_t VrefmV, int32_t sarCounts);


/*******************************************************************************
* Function Name: Cy_AutAnalog_SAR_CountsTo_degreeC
****************************************************************************//**
*
* Converts the ADC output to degrees Celsius.
*
* \warning Vbgr should be used as reference voltage when measuring the die temperature.
*
* \note The die temperature measurement only works for MUX channels in differential configuration
*  for LP mode and pseudo differential configuration for HS mode.
*
* \note The averaging can be activated to reduce noise.
*
* \param sarIdx
* The index of the ADC subsystem within the Autonomous Analog,
* see \ref cy_stc_autanalog_cfg_t::sar.
*
* \param sarLP
* The operating mode of the ADC
* - FALSE - High Speed;
* - TRUE - Low Power;
*
* \param sarSequencer
* The ADC sequencer to convert the output data to degrees Celsius,
* valid range 0...31.
*
* \param sarChannel
* The ADC channel for conversion,
* valid range: 0...15.
*
* \param sarCounts
* The conversion result, see \ref Cy_AutAnalog_SAR_ReadResult.
* If conversion data is received from FIFO, see \ref Cy_AutAnalog_FIFO_ReadWord
* (\ref Cy_AutAnalog_FIFO_ReadAllData, \ref Cy_AutAnalog_FIFO_ReadDataChanId).
*
* \return
* The ADC result in degrees Celsius.
* \note The function returns 0 on invalid parameters or incorrect averaging configuration.
*
*******************************************************************************/
int16_t Cy_AutAnalog_SAR_CountsTo_degreeC(uint8_t sarIdx, bool sarLP, uint8_t sarSequencer, uint8_t sarChannel,
        int32_t sarCounts);

/** \} group_autanalog_sar_functions_conv */

/** \} group_autanalog_sar_functions */


/**
* \addtogroup group_autanalog_fifo_functions
* \{
*/

/**
* \addtogroup group_autanalog_fifo_functions_init
* This set of functions is used to configure the FIFO.
* \{
*/

