PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/include/cy_autanalog_sar.h
/*******************************************************************************
* Function Name: Cy_AutAnalog_FIFO_LoadConfig
****************************************************************************//**
*
* Configures the FIFO operating mode per provided settings.
*
* \param fifoIdx
* The index of the FIFO subsystem within the Autonomous Analog.
* \note One instance of the FIFO is currently supported.
*
* \param fifoCfg
* The pointer to the FIFO configuration structure \ref cy_stc_autanalog_fifo_cfg_t.
*
* \return
* Status of initialization, \ref cy_en_autanalog_status_t.
*
*******************************************************************************/
cy_en_autanalog_status_t Cy_AutAnalog_FIFO_LoadConfig(uint8_t fifoIdx, const cy_stc_autanalog_fifo_cfg_t * fifoCfg);

/** \} group_autanalog_fifo_functions_init */

/*******************************************************************************
* Function Name: Cy_AutAnalog_FIFO_GetSize
****************************************************************************//**
*
* Returns the current number of data samples in the specified FIFO buffer.
*
* \param fifoIdx
* The index of the FIFO subsystem within the Autonomous Analog.
* \note One instance of the FIFO is currently supported.
*
* \param buffIdx
* The buffer index within the FIFO subsystem.
* The number of buffers depends on the \ref cy_stc_autanalog_fifo_cfg_t::split setting.
*
* \return
* The 9-bit number of data samples.
* \note Under invalid FIFO index, "zero" returns in the result.
*
*******************************************************************************/
__STATIC_INLINE uint16_t Cy_AutAnalog_FIFO_GetSize(uint8_t fifoIdx, uint8_t buffIdx)
{
    uint32_t baseAddr;

    CY_ASSERT_L2(AUTANALOG_MMIO_FIFO_BUFF_IDX(buffIdx));

    return CY_AUTANALOG_SUCCESS == Cy_AutAnalog_IdxToBaseAddr(CY_AUTANALOG_FIFO, fifoIdx, &baseAddr) ?
           (uint16_t)_FLD2VAL(LPPASS_MMIO_STA_USED_USED, AUTANALOG_MMIO_FIFO_STA_USED(baseAddr, buffIdx)) : 0U;
}


/*******************************************************************************
* Function Name: Cy_AutAnalog_FIFO_ReadWord
****************************************************************************//**
*
* Reads one data sample from the specified FIFO buffer.
* \note The ADC result sign extended to 32 bits.
*
* \param fifoIdx
* The index of the FIFO subsystem within the Autonomous Analog.
* \note One instance of the FIFO is currently supported.
*
* \param buffIdx
* The buffer index within the FIFO subsystem.
* The number of buffers depends on the \ref cy_stc_autanalog_fifo_cfg_t::split setting.
*
* \return
* The 32-bit data sample.
* \note If the FIFO index is not valid, zero is returned in the result.
*
*******************************************************************************/
__STATIC_INLINE int32_t Cy_AutAnalog_FIFO_ReadWord(uint8_t fifoIdx, uint8_t buffIdx)
{
    uint32_t baseAddr;

    CY_ASSERT_L2(AUTANALOG_MMIO_FIFO_BUFF_IDX(buffIdx));

    CY_MISRA_DEVIATE_BLOCK_START('MISRA C-2012 Rule 10.8', 1, 'Review shows that type conversion from unsigned to signed does not have any negative drawbacks');
    return CY_AUTANALOG_SUCCESS == Cy_AutAnalog_IdxToBaseAddr(CY_AUTANALOG_FIFO, fifoIdx, &baseAddr) ?
           (int32_t)_FLD2VAL(LPPASS_MMIO_STA_RD_DATA_RESULT, AUTANALOG_MMIO_FIFO_STA_RD_DATA(baseAddr, buffIdx)) : 0;
    CY_MISRA_BLOCK_END('MISRA C-2012 Rule 10.8');
}


/*******************************************************************************
* Function Name: Cy_AutAnalog_FIFO_ReadData
****************************************************************************//**
*
* Reads the given number of words from the specified FIFO buffer.
* \note The ADC result sign extended to 32 bits.
*
* \param fifoIdx
* The index of the FIFO subsystem within the Autonomous Analog.
* \note One instance of the FIFO is currently supported.
*
* \param buffIdx
* The buffer index within the FIFO subsystem.
*
* \param words
* The number of words to read from the FIFO buffer.
*
* \param data
* The pointer to the data array with a size bigger or equal to
* the number of words to read from the FIFO buffer.
*
* \return
* The 9-bit size of the buffer payload to be copied into the data array.
*
*******************************************************************************/
uint16_t Cy_AutAnalog_FIFO_ReadData(uint8_t fifoIdx, uint8_t buffIdx, uint16_t words, int32_t * data);


/*******************************************************************************
* Function Name: Cy_AutAnalog_FIFO_ReadAllData
****************************************************************************//**
*
* Reads all data from the specified FIFO buffer.
* \note The ADC result sign extended to 32 bits.
*
* \param fifoIdx
* The index of the FIFO subsystem within the Autonomous Analog.
* \note One instance of the FIFO is currently supported.
*
* \param buffIdx
* The buffer index within the FIFO subsystem.
* The number of buffers depends on the \ref cy_stc_autanalog_fifo_cfg_t::split setting.
*
* \param data
* The pointer to the data array with a size not less than the buffer size
* (specified by the \ref cy_stc_autanalog_fifo_cfg_t::split setting)
*
* \return
* The 9-bit size of the buffer payload to be copied into the data array.
*
*******************************************************************************/
uint16_t Cy_AutAnalog_FIFO_ReadAllData(uint8_t fifoIdx, uint8_t buffIdx, int32_t * data);


/*******************************************************************************
* Function Name: Cy_AutAnalog_FIFO_ReadDataChanId
****************************************************************************//**
*
* Reads all of the data and the channel IDs from the specified FIFO buffer.
* \note The ADC result sign extended to 32 bits.
*
* \param fifoIdx
* The index of the FIFO subsystem within the Autonomous Analog.
* \note One instance of the FIFO is currently supported.
*
* \param buffIdx
* The buffer index within the FIFO subsystem.
* The number of buffers depends on the \ref cy_stc_autanalog_fifo_cfg_t::split setting.
*
* \param input
* The ADC input type is either GPIO or MUX.
*
* \param data
* The pointer to the data array with a size not less than the buffer size
* (specified by the \ref cy_stc_autanalog_fifo_cfg_t::split setting)
*
* \param chanID
* The pointer to the channel IDs array with a size not less than the buffer size
* (specified by the \ref cy_stc_autanalog_fifo_cfg_t::split setting)
*
* \return
* The 9-bit size of the buffer payload to be copied into the data and the channel ID arrays.
*
*******************************************************************************/
uint16_t Cy_AutAnalog_FIFO_ReadDataChanId(uint8_t fifoIdx, uint8_t buffIdx, cy_en_autanalog_sar_input_t input, int32_t * data, uint8_t * chanID);


/**
* \addtogroup group_autanalog_fifo_functions_int
* This set of functions is used to handle interrupts in the FIFO.
* \{
*/

