PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/include/cy_autanalog_sar.h
/*******************************************************************************
* Function Name: Cy_AutAnalog_FIFO_GetInterruptCause
****************************************************************************//**
*
* Returns the cause of the interrupt for the FIFO subsystem.
*
* \param fifoIdx
* The index of the FIFO subsystem within the Autonomous Analog.
* \note One instance of the FIFO is currently supported.
*
* \return
* The mask of the event, which causes an interrupt in the FIFO subsystem.
* See \ref group_autanalog_fifo_macros section for defined interrupts in the FIFO.
*
*******************************************************************************/
__STATIC_INLINE uint32_t Cy_AutAnalog_FIFO_GetInterruptCause(uint8_t fifoIdx)
{
    CY_UNUSED_PARAMETER(fifoIdx);

    return AUTANALOG_MMIO_FIFO_INTR_CAUSE(LPPASS_MMIO_BASE);
}


/*******************************************************************************
* Function Name: Cy_AutAnalog_FIFO_GetInterruptStatus
****************************************************************************//**
*
* Returns the status of combined FIFO subsystem interrupt requests.
*
* \param fifoIdx
* The index of the FIFO subsystem within the Autonomous Analog.
* \note One instance of the FIFO is currently supported.
*
* \return
* The combined mask of interrupt requests for the FIFO subsystem.
* See \ref group_autanalog_fifo_macros section for defined interrupts in the FIFO.
*
*******************************************************************************/
__STATIC_INLINE uint32_t Cy_AutAnalog_FIFO_GetInterruptStatus(uint8_t fifoIdx)
{
    CY_UNUSED_PARAMETER(fifoIdx);

    return AUTANALOG_MMIO_FIFO_INTR(LPPASS_MMIO_BASE);
}


/*******************************************************************************
* Function Name: Cy_AutAnalog_FIFO_ClearInterrupt
****************************************************************************//**
*
* Clears the interrupts for the FIFO subsystem.
* \note The interrupt is only cleared when the contents of the FIFO drop below
* the \ref cy_stc_autanalog_fifo_cfg_t::level condition.
*
* \param fifoIdx
* The index of the FIFO subsystem within the Autonomous Analog.
* \note One instance of the FIFO is currently supported.
*
* \param interrupt
* The mask of the interrupts to be cleared. Each bit of this mask is responsible for
* clearing of the corresponding interrupt in the FIFO subsystem.
* See \ref group_autanalog_fifo_macros section for defined interrupts in the FIFO.
*
*******************************************************************************/
__STATIC_INLINE void Cy_AutAnalog_FIFO_ClearInterrupt(uint8_t fifoIdx, uint32_t interrupt)
{
    CY_UNUSED_PARAMETER(fifoIdx);

    CY_ASSERT_L2(CY_AUTANALOG_INTR_FIFO_MASK(interrupt));

    AUTANALOG_MMIO_FIFO_INTR(LPPASS_MMIO_BASE) = CY_AUTANALOG_INTR_FIFO & interrupt;

    /*
     * This dummy read guarantees that the interrupt will be cleared on return from this function.
     */
    (void) AUTANALOG_MMIO_FIFO_INTR(LPPASS_MMIO_BASE);
}


/*******************************************************************************
* Function Name: Cy_AutAnalog_FIFO_SetInterrupt
****************************************************************************//**
*
* Sets a software interrupt request for the FIFO subsystem.
*
* \param fifoIdx
* The index of the FIFO subsystem within the Autonomous Analog.
* \note One instance of the FIFO is currently supported.
*
* \param interrupt
* The mask of the interrupts to be set. Each bit of this mask is responsible for
* triggering of the corresponding interrupt in the FIFO subsystem.
* See \ref group_autanalog_fifo_macros section for defined interrupts in the FIFO.
*
*******************************************************************************/
__STATIC_INLINE void Cy_AutAnalog_FIFO_SetInterrupt(uint8_t fifoIdx, uint32_t interrupt)
{
    CY_UNUSED_PARAMETER(fifoIdx);

    CY_ASSERT_L2(CY_AUTANALOG_INTR_FIFO_MASK(interrupt));

    AUTANALOG_MMIO_FIFO_INTR_SET(LPPASS_MMIO_BASE) = CY_AUTANALOG_INTR_FIFO & interrupt;
}


/*******************************************************************************
* Function Name: Cy_AutAnalog_FIFO_SetInterruptMask
****************************************************************************//**
*
* Configures which bits of the interrupt request register will trigger
* an interrupt event in the FIFO subsystem.
*
* \param fifoIdx
* The index of the FIFO subsystem within the Autonomous Analog.
* \note One instance of the FIFO is currently supported.
*
* \param mask
* The mask of interrupts allowed to be activated. Each bit of this mask
* allows the corresponding interrupt to be triggered in the FIFO subsystem.
* See \ref group_autanalog_fifo_macros section for defined interrupts in the FIFO.
*
*******************************************************************************/
__STATIC_INLINE void Cy_AutAnalog_FIFO_SetInterruptMask(uint8_t fifoIdx, uint32_t mask)
{
    CY_UNUSED_PARAMETER(fifoIdx);

    CY_ASSERT_L2(CY_AUTANALOG_INTR_FIFO_MASK(mask));

    AUTANALOG_MMIO_FIFO_INTR_MASK(LPPASS_MMIO_BASE) = CY_AUTANALOG_INTR_FIFO & mask;
}


/*******************************************************************************
* Function Name: Cy_AutAnalog_FIFO_ClearInterruptMask
****************************************************************************//**
*
* Configures which bits of the interrupt request register will be cleared
* in the FIFO subsystem.
*
* \param fifoIdx
* The index of the FIFO subsystem within the Autonomous Analog.
* \note One instance of the FIFO is currently supported.
*
* \param mask
* The mask for the clearing of the bits of the interrupt request register
* in the FIFO subsystem.
* See \ref group_autanalog_fifo_macros section for defined interrupts in the FIFO.
*
*******************************************************************************/
__STATIC_INLINE void Cy_AutAnalog_FIFO_ClearInterruptMask(uint8_t fifoIdx, uint32_t mask)
{
    CY_UNUSED_PARAMETER(fifoIdx);

    CY_ASSERT_L2(CY_AUTANALOG_INTR_FIFO_MASK(mask));

