PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/include/cy_autanalog_sar.h
    AUTANALOG_MMIO_FIFO_INTR_MASK(LPPASS_MMIO_BASE) &= CY_AUTANALOG_INTR_FIFO & (~mask);
}


/*******************************************************************************
* Function Name: Cy_AutAnalog_FIFO_GetInterruptMask
****************************************************************************//**
*
* Returns the interrupt mask. Each bit of this mask represents an interrupt
* that is allowed in the FIFO subsystem.
*
* \param fifoIdx
* The index of the FIFO subsystem within the Autonomous Analog.
* \note One instance of the FIFO is currently supported.
*
* \return
* The mask of the interrupts that can be activated.
* See \ref group_autanalog_fifo_macros section for defined interrupts in the FIFO.
*
*******************************************************************************/
__STATIC_INLINE uint32_t Cy_AutAnalog_FIFO_GetInterruptMask(uint8_t fifoIdx)
{
    CY_UNUSED_PARAMETER(fifoIdx);

    return AUTANALOG_MMIO_FIFO_INTR_MASK(LPPASS_MMIO_BASE);
}


/*******************************************************************************
* Function Name: Cy_AutAnalog_FIFO_GetInterruptStatusMasked
****************************************************************************//**
*
* Returns the result of the bitwise AND operation between the
* corresponding interrupt request and mask bits.
* See \ref Cy_AutAnalog_FIFO_GetInterruptStatus and \ref Cy_AutAnalog_FIFO_SetInterruptMask.
*
* \param fifoIdx
* The index of the FIFO subsystem within the Autonomous Analog.
* \note One instance of the FIFO is currently supported.
*
* \return
* The masked status of combined interrupt requests for the FIFO subsystem.
* See \ref group_autanalog_fifo_macros section for defined interrupts in the FIFO.
*
*******************************************************************************/
__STATIC_INLINE uint32_t Cy_AutAnalog_FIFO_GetInterruptStatusMasked(uint8_t fifoIdx)
{
    CY_UNUSED_PARAMETER(fifoIdx);

    return AUTANALOG_MMIO_FIFO_INTR_MASKED(LPPASS_MMIO_BASE);
}

/** \} group_autanalog_fifo_functions_int */

/** \} group_autanalog_fifo_functions */

#if defined(__cplusplus)
}
#endif

#endif /* CY_IP_MXS22LPPASS_SAR */

#endif /** !defined(CY_AUTANALOG_SAR_H) */

/* [] END OF FILE */
